[
    {
        "title": "Dow Jones Futures: Nvidia Leads 7 New Buys As Market Roars; Fed, Apple, Super Micro Loom",
        "url": "https://finance.yahoo.com/m/ae13c909-3596-347c-9707-4eb73495cacb/dow-jones-futures%3A-nvidia.html",
        "content": "Nvidia and several other leaders flashed buy signals as the market roared. Investors should take advantage, but it's a jungle out there. Continue reading View comments"
    },
    {
        "title": "The AI trade is back, as confidence in Big Tech surges",
        "url": "https://finance.yahoo.com/news/the-ai-trade-is-back-as-confidence-in-big-tech-surges-160013297.html",
        "content": "The AI craze has returned to Wall Street — and investors are buying back in.Standout quarterly results from Microsoft (MSFT) and Alphabet (GOOG, GOOGL) plus a well-received IPO debut for Rubrik (RBRK) have put the AI narrative back on track, sparking renewed confidence that big tech’s expensive bets on splashy tools is boosting growth.Alphabet shares soared to an all-time high on Friday, closing above a $2 trillion market cap for the first time. Microsoft shares ended up 1.8%, sporting a market a shade over $3 trillion.“The AI investment story is intact,” BMO Wealth Management U.S. chief investment officer Yung-Yu Ma told Yahoo Finance.Outperformance by Microsoft and Alphabet, along with Elon Musk's automaker turn AI play Tesla (TSLA), pushed the S&P 500 (^GSPC) and Nasdaq (^IXIC) to their best weekly performance this year.“They're delivering on earnings,” HSBC’s Nicole Inui told Yahoo Finance. “This is a secular growth story, and we think the sector continues to stay strong over the second half of the year.”Results from Microsoft and Google gave Wall Street an early glimpse at how AI will drive stocks for years to come. Microsoft said AI services accounted for 7 percentage points of the 31% revenue jump in its Azure cloud division.Meanwhile, increasing contributions from AI helped Google’s cloud revenue surge 28%, compared to a year ago.“The commentary from both Google and Microsoft tells us that there is real demand for AI,” RBC Capital Markets analyst Rishi Jaluria told Yahoo Finance. “It's not just hype, it's not just people talking about it. There's actual capital being put to work.”In a note to clients this week, Bank of America’s Michael Hartnett wrote that “narrow mega-cap growth leadership” will remain intact until threats of a recession materialize.And the AI opportunity goes far beyond Microsoft and Google — the two companies often viewed by Wall Street as leaders in the AI race.RBC Capital Markets internet analyst Brad Erickson told Yahoo Finance that Meta’s (META) selloff following earnings was an “overreaction,” and believes AI will be a “transformational driver\" for the company.“We’d be buying it,” Erickson said.The rally in several Mag 7 stocks arrives ahead of key results from Amazon (AMZN) and Apple (AAPL) this coming week — two earnings reports that will be another critical test for the AI tech trade amid sky-high valuations.Curious on the best Mag 7 name to trade in May amid the acronym's comeback? On the latest episode of the Opening Bid podcast, we discuss just that. Tune in below.Story continuesSeana Smith is an anchor at Yahoo Finance. Follow Smith on Twitter @SeanaNSmith. Tips on deals, mergers, activist situations, or anything else? Email seanasmith@yahooinc.com.Click here for the latest technology news that will impact the stock market.Read the latest financial and business news from Yahoo FinanceView comments"
    },
    {
        "title": "3 Reasons to Buy Apple Stock Like There's No Tomorrow",
        "url": "https://finance.yahoo.com/m/66d3b3c4-b430-3c79-822d-b96e63528f91/3-reasons-to-buy-apple-stock.html",
        "content": "The past few weeks have been tough for Apple (NASDAQ: AAPL) shareholders. The stock's now sitting 15% below its December high, sliding all the way back to where it was trading in late 2021. This is weakness that most investors just aren't accustomed to seeing from this frequent Wall Street favorite.If you're interested in stepping into a new position in Apple, don't let the stock's recent performance rattle you. There are still good reasons to take on long-term trades in this consumer-technology titan. Here's a rundown of the best three.1. The company's dealing with the headwind in ChinaPerhaps the single-biggest reason Apple shares have stumbled of late is the company's recent performance in China. It's not been great. The nation just isn't evolving into the growth engine it was once expected to become.Indeed, after clawing its way to becoming the country's smartphone market-share leader last year (by virtue of losing less than its rivals), technology market research outfit IDC reports Apple's iPhone lost that lead again in the first quarter of this year. It's a microcosm of the company's struggle in the region.The company is finally dealing with the challenge if only by turning its attention to more promising markets. That's southeast Asia and India, by the way. Earlier this month, CEO Tim Cook visited Singapore, committing $250 million to expand operations there. Apple's also investing heavily in India as a manufacturing partner as well as a market for its goods and services.Bloomberg reports India assembled $14 billion worth of iPhones last fiscal year, with the country also seeing the opening of its first-ever Apple store in 2023. Counterpoint Research reports Apple is now leading India's smartphone market as measured by revenue, while analysts with Morgan Stanley say India alone could account for 15% of Apple's revenue growth over the course of the coming five years.It's certainly a compelling start to weaning itself from China where doing business is proving increasingly tricky.2. Apple is finally getting serious about AIThe advent of artificial intelligence (AI) has taken shape without much obvious involvement from Apple. But that's about to change. Without fleshing out any significant details, in February CEO Tim Cook said some AI-powered features of the company's next generation technology would be revealed at some point later this year.What sort of features? That's just it. He didn't say. Given the work the company's been doing, it's not a stretch to suggest that Apple's new A17 processor and the next iteration of its operating system (iOS 18) will likely allow iPhone owners to do generative AI work on their devices rather than in the cloud (where most generative AI tasks are actually handled right now). This of course has the potential to make Apple's onboard assistant Siri an even more powerful tool.Story continuesAnd it matters. As Evercore ISI analyst Amit Daryanani describes it, Apple's consumer-facing AI offerings could spark a \"supercycle\" of demand for the iPhone.It's not just its consumer-oriented features that will be improved by artificial intelligence. Apple's tech is also capable of doing things like optimizing ad placements and helping digital cameras (or augmented reality equipment) understand what an object or image is.All told, Wedbush analyst Daniel Ives believes Apple's AI offerings could -- just as a starting point -- add another $5 billion to the company's annual top line.3. Cash is still flowing like crazyWhile sales growth has been hit and miss lately, that hasn't prevented Apple from continuing to pump up its profits. The $100.9 billion worth of net income the company's produced over the course of the past four reported quarters is nearly a record, second only to the 12-month stretch ending in early 2022 (following the surge of smartphone purchases that had been put on hold during and because of the pandemic).What gives? Credit the growth of Apple's services business, mostly. Sales of apps and streaming content improved 11% year over year last quarter, but more than that, this revenue is very high margin. Roughly three-fourths of the company's services sales are converted into gross profit versus only 40% of product-driven revenue. The slow shift toward more service-oriented business is proving disproportionately lucrative. And this will likely remain the case for the indefinite future.The ultimate end result is, of course, cash flow. And Apple's got plenty of that and can do a wide range of things with this cash, including bumping up its dividend, paying off debt, or acquiring complementary companies. Few other companies have such options.AAPL Net Income (TTM) ChartApple is also sitting on $73 billion worth of cash and cash-like instruments plus another $99 billion worth of marketable securities, by the way, bolstering its fiscal flexibility should it need it.Before you take the plungeReady to dive in? There's good reason to wait just a little bit longer. That is, the company's scheduled to release its fiscal Q2 numbers after the market closes on Thursday, May 2. This could result in volatility; it might send the stock lower. We just don't know. For investors who can't stomach a rough start with a new position, missing out on a post-earnings pop is more palatable than riding out a post-earnings plunge.If Apple shares do peel back following its Q2 results, that's absolutely a buying opportunity. This year's weakness from the stock already bakes in the worst-case scenario (and then some) without considering enough of the bullish initiatives the company is currently taking. The market may dish out one more knee-jerk reaction to any bearish spin in Q2's numbers.If that's what ends up taking shape, however, it should actually flush out the last of the would-be sellers, leaving buyers behind for a while. That's, of course, your call to make. Just know that these timing-minded strategies usually don't matter much in the end for true long-term positions.Should you invest $1,000 in Apple right now?Before you buy stock in Apple, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $537,557!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of April 22, 2024James Brumley has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has a disclosure policy.3 Reasons to Buy Apple Stock Like There's No Tomorrow was originally published by The Motley FoolView comments"
    },
    {
        "title": "Jim Cramer Portfolio: 11 Latest Stocks to Buy",
        "url": "https://finance.yahoo.com/news/jim-cramer-portfolio-11-latest-132055049.html",
        "content": "In this article, we will take a detailed look at Jim Cramer Portfolio: 11 Latest Stocks to Buy. If you want to skip our detailed analysis on Jim Cramer's latest thoughts about the economy and see the top 5 stocks in this list, click Jim Cramer Portfolio: 5 Latest Stocks to Buy.Jim Cramer in a program last week welcomed signs of an economic slowdown, saying \"finally\" he is seeing \"brown shoots\" that could signal the Wall Street that the Fed might be winning its battle against inflation. Jim Cramer admitted that \"it's been hard to parse this economy.\" He said in March when a \"steaming hot\" jobs report came, it seemed like the Fed was \"blindsided\" because it was talking about multiple rate cuts this year.\"You don’t do that when the job market is booming. Anything that makes the Fed look stupid hurts its ability to maintain price stability.\"Cramer Welcomes \"Brown Shoots\" Signaling Economic SlowdownJim Cramer said that just when the Wall Street was about to give up on the possibility of rate hikes, we are seeing signs of an economic slowdown. To back his thesis, Cramer talked about some examples depicting a broader cooldown in the economy. He said J. B. Hunt, the Arkansas-based transportation and logistics company, had a strong January and February but its business \"shrunk\" in March and the company's total operating revenue fell 9% during the first quarter.Cramer also mentioned logistics and warehouse REIT Prologis. He said the company lowered its guidance just a month after \"coming to this show.\" Cramer was referring to Prologis CEO Hamid Moghadam's interview on CNBC with Cramer where, according to the Mad Money host, the company gave a \"bullish story.\" Cramer said during the interview the company indicated that it was experiencing weakness only in California but now it seems those problems are spreading to other areas too including Seattle and New Jersey. Cramer said part of the reason why these companies suffered is a possible slowdown in the ecommerce market.\"Because even ecommerce isn’t safe and that, you can feel.\"Snap-On Inc (NYSE:SNA) was another stock mentioned by Cramer whose earnings show signs of an economic slowdown in the US following rate hikes. The tools and equipment company posted some \"really weak numbers\" according to Cramer, and he believes that's a \"genuine surprise\" from a usually reliable company.Another surprise came from Sherwin-Williams, which indicated that it's feeling \"choppiness\" in the business. Cramer said \"anything home related\" has been quite strong until now. But following the latest numbers, Cramer said Sherwin-Williams shares got \"clobbered.\"Story continuesSherwin-Williams mentioned the word \"choppiness\" or \"choppy\" several times during its Q1 earnings call. Here's a comment from Sherwin-Williams CEO from the Q1 earnings call:\"While market conditions are choppy and may give others in our industry a moment of pause, let me be clear, we are not pausing. So this morning, I’m going to talk as much about our results as I am about what we’re doing to ensure the momentum of our company not only continues but accelerates our ability to widen the gap between us and our competition. So let me start with the results of the first quarter. As Jim mentioned, our first quarter is a seasonally smaller one and our results do not necessarily dictate how our full year will unfold. While our sales came in within our guidance, it was at the lower end of our range.\"Read the full Q1 earnings call transcript here.Jim Cramer Portfolio: 11 Latest Stocks to BuyFor this article we watched several latest programs of Jim Cramer and picked 11 stocks he recently recommended investors to buy or hold. Instead of major names like Apple Inc (NASDAQ:AAPL), NVIDIA Corp (NASDAQ:NVDA) and Microsoft Corp (NASDAQ:MSFT), which Cramer has been repeatedly recommending for the long term, you will see some new names in the list.11. Vista Energy SAB de CV - ADR (NYSE:VIST)Number of Hedge Fund Investors: 13Mexico-based energy company Vista Energy SAB de CV - ADR (NYSE:VIST) is one of the stocks Jim Cramer is bullish on. When asked about Vista Energy SAB de CV - ADR (NYSE:VIST) in a recent program, Cramer said Mexico has changed some rules in the industry which would be \"good\" for Vista Energy SAB de CV - ADR (NYSE:VIST). Cramer said that he would \"actually own\" this stock.\"I think it's a good situation.\"10. Rhythm Pharmaceuticals Inc (NASDAQ:RYTM)Number of Hedge Fund Investors: 30Biopharma company Rhythm Pharmaceuticals Inc (NASDAQ:RYTM) is a latest Jim Cramer stock pick because of obesity-related growth catalysts. When asked about the company, Cramer said it's a speculative play  but emphasized that he is \"not against speculating biotechs right now.\"\"Looks like that there are so many bids, I'm willing to let a stock catch fire,\" Cramer added.9. PNC Financial Services Group Inc (NYSE:PNC)Number of Hedge Fund Investors: 37Cramer said that \"people didn’t like\" the latest PNC Financial Services Group, Inc. (NYSE:PNC) quarter. But he disagrees:\"I on the other hand felt it was an enjoyable quarter.\"Cramer recommended investors to buy some PNC Financial Services Group, Inc. (NYSE:PNC) shares now and buy more when the stock comes down about 10%.\"You'll have a terrific position that will last a very long time,\" Cramer said.Carillon Eagle Growth & Income Fund stated the following regarding The PNC Financial Services Group, Inc. (NYSE:PNC) in its fourth quarter 2023 investor letter:“The PNC Financial Services Group, Inc. (NYSE:PNC) and JPMorgan performed well due to more benign inflation data, which the market likely interpreted as a sign that a recession is now less likely to occur. Recall that historically speaking, banks are hyper-cyclical stocks and typically will trade lower if investors foresee a recession, because recessions tend to trigger loan losses.”8. Axon Enterprise Inc (NASDAQ:AXON)Number of Hedge Fund Investors: 37Axon Enterprise Inc (NASDAQ:AXON) makes technology and weapons for law enforcement and military. Jim Cramer thinks this company is an \"ecosystem of law enforcement.\"Jim Cramer said Axon Enterprise Inc (NASDAQ:AXON) is good \"even here.\" Over the past six months, Axon Enterprise Inc (NASDAQ:AXON) shares have gained about 53%.As of the end of the fourth quarter of 2023, 37 hedge funds reported owning stakes in the company.Like AXON, Cramer is also bullish on Apple Inc (NASDAQ:AAPL), NVIDIA Corp (NASDAQ:NVDA) and Microsoft Corp (NASDAQ:MSFT).7. Cloudflare Inc (NYSE:NET)Number of Hedge Fund Investors: 44Jim Cramer recently hit the \"Buy, Buy, Buy\" button on Cloudflare, Inc. (NYSE:NET), saying the company's CEO Matthew Prince \"rocks.\" Cramer said he'd be a \"buyer\" of this stock. However, the CNBC host said he'd buy Cloudflare, Inc. (NYSE:NET) \"slowly\" because there's a lot of \"big selling\" going on. In addition to NET, Cramer recommends Apple Inc (NASDAQ:AAPL), NVIDIA Corp (NASDAQ:NVDA) and Microsoft Corp (NASDAQ:MSFT) in the tech industry for the long term.Baron Fifth Avenue Growth Fund stated the following regarding Cloudflare, Inc. (NYSE:NET) in its fourth quarter 2023 investor letter:“Most of our portfolio companies have seen stabilization and modest improvements in short-term business fundamentals as the year progressed. More importantly in our view, many have been able to drive significant improvement in long-term Key Performance Indicators (KPIs) such as share gains, meaningful expansion of their total addressable market, and improvement in unit economics. These KPIs are significantly more important in driving the intrinsic values of our businesses, which we believe have increased noticeably during 2023. In the meantime, disruptive changes that we expect will benefit many of our businesses have also continued to pick up steam. Some examples include: • Another example is the leading cloud networking and cybersecurity solution provider, Cloudflare, Inc. (NYSE:NET), who described market share gains and customers consolidating from multiple point solutions to Cloudflare’s platform: “And so we’re the one vendor that is able to give people that vendor consolidation, that single pane of glass… that comes through in a lot of customer examples…. people want to buy the entire Cloudflare, Inc. (NYSE:NET) platform. They want to protect their entire business with that, and that’s driving more interest in both our network security, as well as our Zero Trust products.”6. Crown Castle Inc (NYSE:CCI)Number of Hedge Fund Investors: 45Jim Cramer is recommending investors to hold Crown Castle Inc (NYSE:CCI) because of its high dividend yield. Cramer in a program earlier this month said the company has been \"mismanaged\" but he thinks Crown Castle Inc (NYSE:CCI) can \"bottom here\" because of its over 6% dividend yield.Of the 933 hedge funds in Insider Monkey's database of hedge funds, 45 hedge funds reported owning stakes in Crown Castle Inc (NYSE:CCI) as of the end of 2023. Click to continue reading and see Jim Cramer Portfolio: 5 Latest Stocks to Buy. Suggested Articles:Jim Cramer is Talking About Trump Media and 10 Other StocksJim Cramer’s New Picks: 10 Stocks to Buy10 Stocks You Should Not Buy According to Jim CramerDisclosure. None. Jim Cramer Portfolio: 11 Latest Stocks to Buy is originally published on Insider Monkey.View comments"
    },
    {
        "title": "Artificial Intelligence Could Propel This \"Magnificent Seven\" Stock 33% Higher, a Wall Street Analyst Says",
        "url": "https://finance.yahoo.com/m/f54c877b-a16f-360d-9add-cd7cba7cb236/artificial-intelligence-could.html",
        "content": "The \"Magnificent Seven\" have been the driving force behind the current bull market. If there's one trend that's been pushing the stock prices of big tech companies higher, it's artificial intelligence (AI).Practically every member of the Magnificent Seven has a deep connection with the current push to advance AI:Nvidia is the leading GPU chip designer, supplying growing data centers designed to train large language models.Microsoft, Amazon, and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) are leading public cloud providers, providing access to foundational models for developers to create new AI-powered apps. All three have big investments in their own large language models and chip designs as well.Meta Platforms is developing a leading large language model, LLaMA, spending billions on data centers to train and implement its AI across its apps.Tesla is racing toward a robotaxi service powered by its massive investments in AI.Just one member of the seven has been exceptionally quiet about its AI: Apple (NASDAQ: AAPL). The iPhone maker typically doesn't like to talk about what it's working on until it's ready for release. But that could change this summer.Several analysts believe Apple will make several big AI-related announcements this year. And one analyst expects AI-related products and services will push its stock price to $225, about 33% higher than the price as of this writing.Image source: Getty Images.The summer of Apple AIBank of America analyst Wamsi Mohan sees the recent pullback in Apple shares as a great buying opportunity ahead of the company's typical event schedule, which is set for this summer.He sees Apple making a series of AI-related announcements at its annual Worldwide Developer Conference in June. During the company's annual shareholder meeting, CEO Tim Cook promised investors that Apple will \"break new ground\" on generative AI this year. So the stage is set for Cook to unveil some big products and services.Nobody knows what Apple could announce. While management has said it's spending a lot of time and money on generative AI, it hasn't provided much in the way of details.Several reports surfaced last month that Apple was in talks with Google to bring its Gemini AI to iPhones and other devices. Such a deal could be a big win for Alphabet, as its AI efforts have been dwarfed by competitors.But putting someone else's AI chatbot on the iPhone is hardly \"breaking new ground.\" Investors should expect more.That might have to wait until the end of summer, though, when Apple announces new iPhones. Mohan expects the 2024 iPhone model (presumably iPhone 16) will offer on-device generative AI capabilities.Story continuesThat could be a big breakthrough for AI and data privacy, a major focus for Apple. Being able to run AI apps on a smartphone without sending data to a server for processing could open up the door for many more AI-powered applications and an AI App Store.Apple is uniquely positioned to offer those capabilities on its hardware since it designs its own chips, some of the most advanced mobile processors available. What's more, they are specially designed to efficiently run Apple's software. That puts it in the driver's seat when it comes to introducing on-device AI to the mass market.Should you buy Apple before its next big announcement?The stock has been one of the worst performers among the Magnificent Seven since the start of 2024. Shares are down more than 12%. Only Tesla's stock has performed worse, with every other member producing positive returns above the S&P 500 index.But the current pullback in price could be a great opportunity for investors. The stock currently trades for just 25.6 times forward earnings estimates. While that multiple is higher than the S&P 500, it's below most of the other members of the Magnificent Seven.What's more, Apple's strong cash position and massive capital-return program give investors good reason to pay a premium for its shares. Mohan sees the company's capital return program as another potential catalyst for shares.Even if Apple doesn't provide investors with much to get excited about in AI, the stability of the iPhone and services business make it a great company to own. Adding new artificial intelligence capabilities, especially if they delivere innovation, could send the shares much higher. At its current price Apple stock appears to have more upside than downside.Should you invest $1,000 in Apple right now?Before you buy stock in Apple, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $537,557!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of April 22, 2024Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Bank of America is an advertising partner of The Ascent, a Motley Fool company. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Adam Levy has positions in Alphabet, Amazon, Apple, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Bank of America, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.Artificial Intelligence Could Propel This \"Magnificent Seven\" Stock 33% Higher, a Wall Street Analyst Says was originally published by The Motley FoolView comments"
    },
    {
        "title": "2 Beaten-Down Dividend Stocks to Buy and Hold Forever",
        "url": "https://finance.yahoo.com/m/ddefe361-c51e-3424-a76e-884519e1c243/2-beaten-down-dividend-stocks.html",
        "content": "Finding \"forever\" stocks isn't easy. Corporations that can thrive and pay dividends for long periods are rare, but they do exist. Such companies tend to have several qualities, including competitive advantages and leadership in industries that are likely to continue growing.Let's consider two stocks that investors can buy and hold for good: Apple (NASDAQ: AAPL) and Abbott Laboratories (NYSE: ABT). Though neither has been popular on Wall Street lately, both have much to offer long-term, income-seeking investors.1. AppleApple is facing multiple issues, including slowing iPhone sales in China and an antitrust lawsuit from the U.S. Department of Justice alleging that it holds a monopoly in the smartphone market. The company's revenue growth is likely to be slow for the next few quarters, while its legal challenges add some uncertainty to its prospects. However, Apple has long known that it cannot forever rely on the iPhone to drive solid top-line growth.That's why the company worked tirelessly to create a robust ecosystem of users to whom it can offer all kinds of services. Apple has an installed base of 2.2 billion devices and growing -- very few companies anywhere in the world have an ecosystem this large, and many would pay a fortune for it. That points to one of Apple's greatest strengths: Its brand name is a powerful moat. Apple's customers are among the most loyal in the smartphone market.Though the company's services unit is still relatively small in terms of revenue -- at least compared to iPhone sales -- there is a long runway for growth for several of the perks it offers, from streaming to fintech options such as Apple Pay. Apple is also working on artificial intelligence (AI), although it has lagged its similarly sized tech peers in this fast-growing space. But the company has never prioritized being first to market.Apple has historically been incredibly successful by adding its own spin to existing technologies and, in some cases, had been around a while before the company got involved. It's hard to ignore the company's innovative track record or its history of excellent financial results.AAPL Revenue (Quarterly) ChartBut what about the Justice Department's lawsuit? Though this could drag on for years, it's extremely unlikely that Apple will be broken up into several companies, in my view. At worst, Apple will incur a fine or settle things out of court. Investors shouldn't worry too much about this lawsuit, although it is worth monitoring.What about the dividend? Apple has increased its payouts by 104% in the past decade. It currently offers a yield of 0.58%, and its cash payout ratio is just 14%. Though Apple's yield is lower than the S&P 500's average of 1.35%, the company's consistent revenue and earnings, strong innovative potential, and ability to generate cash flow make it a strong dividend stock to buy and hold for good.Story continues2. Abbott LaboratoriesAbbott Laboratories is a leading medical device specialist. The company's revenue growth has been pretty slow lately, which partly explains the stock lagging the market.In the first quarter, Abbott's sales of $10 billion grew by just 2.2%. However, the company is facing challenging comparisons. Abbott Laboratories was a leader in the COVID-19 diagnostics market. With much lower demand for these products, comparable sales are dropping. Abbott's revenue in the period increased by 10.8%, excluding its coronavirus-related sales.Abbott Laboratories has a long list of medical devices under its belt. The company has a strong reputation as a leader in its field. It also has deep footprints in the healthcare industry and the expertise and experience required to navigate this incredibly regulated market. These are important advantages, even before considering the many patents it holds that protect its innovative products from competition, at least for a while. The healthcare sector will continue growing, especially with the world's aging population.Abbott Laboratories offers many essential products. Some of its better-known devices still have massive room to grow. That's the case with the FreeStyle Libre, a continuous glucose monitoring (CGM) franchise. CGM devices are a game changer for diabetes patients relying on blood glucose meters (BGMs) to track their sugar levels. CGMs do so automatically and continuously throughout the day, while BGMs are manually operated and only measure blood glucose at a particular point.Yet just 1% of the more than half a billion adults worldwide with diabetes use CGM technology -- a clear growth opportunity for Abbott Laboratories, one of the two leaders in this field. The company has many other exciting products. Abbott has been able to develop new products steadily, which has helped it generate substantial revenue and profits.ABT Revenue (Quarterly) ChartThe company should continue doing so for many more years.Lastly, Abbott Laboratories has increased its dividends for 52 consecutive years, making it a Dividend King. The company's yield tops 2.04%. Although Abbott Laboratories' cash payout ratio of 70% seems a bit high, the company's track record and solid underlying business make it unlikely that it will slash or suspend its dividends. Income seekers can safely hold this stock for good.Should you invest $1,000 in Apple right now?Before you buy stock in Apple, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $537,557!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of April 22, 2024Prosper Junior Bakiny has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Abbott Laboratories and Apple. The Motley Fool has a disclosure policy.2 Beaten-Down Dividend Stocks to Buy and Hold Forever was originally published by The Motley FoolView comments"
    },
    {
        "title": "A Fed meeting, jobs report, and more Big Tech earnings: What to know this week",
        "url": "https://finance.yahoo.com/news/a-fed-meeting-jobs-report-and-more-big-tech-earnings-what-to-know-this-week-113643323.html",
        "content": "Stocks rebounded as tech earnings spawned a rally in markets despite growing concerns that the Fed will hold interest rates higher for longer.The Nasdaq Composite (^IXIC) rose more than 4% last week, while the S&P 500 (^GSPC) popped almost 3%. Meanwhile, the Dow Jones Industrial Average (^DJI) rose less than 1%.In the week ahead, a Fed meeting, the April jobs report, and earnings from Big Tech stalwarts Apple (AAPL) and Amazon (AMZN) will test the recent optimism in markets.Updates on job openings, activity in the services and manufacturing sectors, and consumer confidence are also on the calendar.Companies reporting earnings include AMD (AMD), Coca-Cola (KO), Eli Lilly (LLY), McDonald's (MCD), Novo Nordisk (NVO), Starbucks (SBUX), and Super Micro Computer (SMCI).An update from the FedThe latest decision on interest rate policy from the Federal Open Market Committee is expected on Wednesday, followed by a media press conference with Fed Chair Jerome Powell. Markets widely expect the central bank will hold rates steady.Investors will be closely listening for how the Fed is interpreting recent hotter-than-expected inflation data given that the market has scaled back its rate cut expectations.Read more: What the Fed rate decision means for bank accounts, CDs, loans, and credit cards\"Another round of elevated inflation data is likely to lead to a more hawkish-leaning message at the May FOMC meeting,\" Deutsche Bank chief US economist Matthew Luzzetti wrote in a research note on Friday. \"While we expect the Committee will maintain an easing bias, we also anticipate the statement and press conference will echo Chair Powell’s view that firmer inflation prints suggest it will take longer to gain confidence about disinflation.\"Since Powell said publicly on April 16 that inflation was taking \"longer than expected\" to fall to the Fed's 2% target, data on price increases has come in above expectations. Most recently, the core Personal Consumption Expenditures (PCE) index, which strips out the cost of food and energy and is closely watched by the Federal Reserve, rose 2.8% over the prior year in March, above estimates for 2.7% and unchanged from the annual increase seen in February.After the print, investors were pricing in just a 33% chance that the Fed cuts rates in July, down from an 83% chance a month ago, per the CME FedWatch tool.A look at the labor marketWith the Fed committed to holding rates higher until it feels confident inflation is coming down, there is a continued focus on the health of the labor market. Resilient data has economists hopeful inflation can fall to 2% without the economy slipping into recession despite a higher interest rate environment.Story continuesThe April jobs report is expected to show 250,000 nonfarm payroll jobs were added to the US economy, with unemployment holding steady at 3.8%, according to data from Bloomberg. In March, the US economy added 303,000 jobs while the unemployment rate slipped to 3.8%.And, largely, economists don't expect there to be any signs of cracks in the strong labor market story.\"We don't expect the recent momentum in the labor market to slow,\" BofA US economist Michael Gapen wrote in a weekly note to clients on Friday.Big Tech earnings roll onThe market's reaction to Big Tech earnings has been a mixed bag thus far. Meta's (META) plans to spend heavily on artificial intelligence, along with its softer-than-expected second quarter revenue guidance, gave investors pause. The social media giant's stock fell more than 10% following its earnings release.Alphabet (GOOG, GOOGL) proved to be the winner of the week: Its stock popped more than 10% after the company announced a cash dividend program of $0.20 per share, approval for a $70 billion share repurchase program, and earnings results that topped estimates. The company's market cap topped $2 trillion on Friday.Baird technology desk sector strategist Ted Mortonson reasoned that a large reason behind the divergent moves in the two Big Tech stocks was a \"game of positioning.\" Meta stock had soared over the past year, while Alphabet didn't outperform by nearly as much.This narrative will be put to the test once again in the week ahead when Apple and Amazon are scheduled to report earnings. Apple enters its report with shares down more than 11% this year amid growing concerns over a slowdown in demand. Meanwhile, Amazon is up more than 18% this year and hovering near an all-time high.Earnings scorecardBeyond Big Tech, this week will wrap up the two busiest weeks of reporting for the S&P 500. With 46% of the index having already reported for the quarter, the index is tracking for earnings per share growth of 3.5%, slightly above the 3.2% expected prior to the start of earnings season, per FactSet.At large, companies that beat on earnings per share and revenue are seeing muted positive stock reactions, while companies that miss are seeing more negative stock performance than usual.Strategists have told Yahoo Finance it seems companies are struggling to impress investors and drive big stock reactions after a massive market rally to start the year.\"You don't just need a beat [on earnings and revenue estimates] and hold [on guidance], you need a beat and raise and confidence in the very long-term trajectory of these companies,\" Citi strategist Drew Pettit told Yahoo Finance.Still, there has been a silver lining in earnings reports thus far: Profit margins are increasing. The S&P 500 is pacing for a net profit margin of 11.5% this quarter, above the 11.2% seen last quarter and in line with where margins were a year ago.As Truist co-CIO Keith Lerner noted in the Yahoo Finance Chartbook back in January, a key question for investors in 2024 has been whether or not corporates will be able to preserve margins amid sticky inflation and high interest rates. For now, the answer appears to be yes.Economic CalendarMondayEarnings: Avis Budget Group (CAR), Chegg (CHGG), Domino's Pizza (DPZ), Logitech (LOGI), Paramount (PARA), Philips (PHG), SoFi Technologies (SOFI)Economic news: Dallas Fed manufacturing activity, April (-11.3 expected, -14.4 prior)TuesdayEarnings: Amazon (AMZN), AMD (AMD), Caesars Entertainment (CZR), Coca-Cola (KO), Eli Lilly (LLY), McDonald's (MCD), Oatly (OTLY), Pinterest (PINS), PayPal (PYPL), Riot Platform (RIOT), Super Micro Computer (SMCI), Sirus XM (SIRI), Starbucks (SBUX), 3M (MMM)Economic news: Conference Board Consumer Confidence, April (104.1 expected, 104.7 previously); Employment cost index, first quarter (+1% expected, +0.9% prior); S&P CoreLogic Case-Shiller, 20-City Composite home price index, month-over-month, February (+0.1% expected, +0.14% previously); S&P CoreLogic Case-Shiller 20-City Composite home price index, year-over-year, February (+6.59% previously)WednesdayEarnings: Carvana (CVNA), CVS (CVS), Devon Energy (DVN), Estée Lauder (EL), Etsy (ETSY), Kraft Heinz (KHC), Marriott International (MAR), Mastercard (MA), Norwegian Cruise Line (NCL), Paycom (PAYC), Pfizer (PFE), Qualcomm (QCOM), Wing Stop (WING)Economic news: JOLTS job openings, March (8.72 million expected, 8.76million last month); S&P Global US Manufacturing PMI, April final (49.9 expected, 49.9 previously); ISM Manufacturing, April (50.1expected, 50.3 previously); ISM prices paid, April (55.8 previously); Construction spending month-over-month, Mach (+0.3% expected, -0.3% previously): Federal Open Market Committee rate decision (no change expected)ThursdayEarnings: Apple (AAPL), Block (SQ), Booking Holdings (BKNG), Coinbase (COIN), Cigna (CI), ConocoPhillips (COP), DraftKings (DKNG), Expedia (EXPE), Moderna (MRNA), Novo Nordisk (NVO), Peloton (PTON), Wayfair (W)Economic news: Challenger jobs cuts, year-over-year, April (+0.7% previously) Unit labor costs, first quarter (+2% expected, +0.4% previously); Nonfarm productivity, first quarter (+1.5%% expected, +3.2% previously); Weekly initial jobless claims (217,00 previously); Factory orders, March (+1.6% expected, +1.4% previously); Durable goods orders, March final (2.6% previously)FridayEarnings: fuboTV (FUBO), Hershey (HSY)Economic news: Nonfarm payrolls, April (+250,000 expected, +303,000 previously); Unemployment Rate, April (3.8% expected, 3.8% previously); Average hourly earnings, month-over-month, April (+0.3% expected, +0.3% previously); Average hourly earnings, year-over-year, April (+4% expected, +4.1% previously); Average weekly hours worked, April (34.4 expected, 34.4 previously); Labor force participation rate, April (62.7% previously) S&P Global US Services PMI, April final (50.9 expected, 50.9 previously); ISM Services PMI, April (52 expected, 51.4 previously)View comments"
    },
    {
        "title": "If You Invested $10,000 in Warren Buffett's Top 3 Stocks 10 Years Ago, This Is How Much You'd Have Today",
        "url": "https://finance.yahoo.com/m/e4de1778-244c-3ab4-beff-455ce931a526/if-you-invested-%2410%2C000-in.html",
        "content": "Billionaire investor Warren Buffett has a massive following in the investing world. Many investors often mimic his picks, knowing that investments Buffett chooses for his portfolio have solid fundamentals and can make for good long-term investments. The three top holdings in the Berkshire Hathaway portfolio today are Apple (NASDAQ: AAPL), Bank of America (NYSE: BAC), and American Express (NYSE: AXP). Here's how you would have done if you invested $10,000 into each one of them 10 years ago.Apple Stock: 887% returnApple is the top holding in the Berkshire Hathaway portfolio, at around 41% of the portfolio. The next largest stock (Bank of America) accounts for less than 11%. Buffett is a big fan of Apple's business and it's hard not to like a company that has such a loyal customer base.In each of the past three fiscal years (Apple's year ends in September), the company has generated at least $100 billion in pre-tax profits. And its revenue during those years has totaled at least $365 billion. The company generates great margins on its iPhones and iPads and with more than 2 billion active Apple devices, there's a huge user base to whom the company can potentially upsell more products and services.Although Apple's stock has been struggling this year, if you invested $10,000 into the stock a decade ago, your investment would now be worth close to $99,000 when including the dividend.Bank of America: 180% returnBerkshire's next-largest holding is Bank of America. It's a distant second but it's still a notable investment. Buffett loves bank stocks and insurance companies, so it's little wonder why Bank of America would be a top holding. It's one of the top banks in the country and it's one of the safest stocks investors can hold in their portfolios.Bank of America generates impressive margins as its net income has totaled around $25 billion or higher in each of the past three years, and revenue during that stretch has grown from $89 billion to just under $99 billion this past year.Buffett has long been a believer in betting on America and there are few better ways to invest in the economy than by holding shares of a top bank. Even now, with Bank of America trading at just 1.1 times its book value, it's an attractive stock to own, especially when you also factor in its dividend yield of 2.6%.Bank of America hasn't been the growth machine that Apple has been over the past decade, but you still would have nearly tripled your money here. When including the dividend, a $10,000 investment in the bank stock 10 years ago would now be worth around $28,000.Story continuesAmerican Express: 209%Buffett loves financial stocks and in Berkshire's portfolio, you'll find all three major credit card companies accounted for. American Express, however, ranks higher than Visa and Mastercard. One of the reasons is likely its more affluent customer base. As is the case with Apple, these types of customers may be in better financial shape to handle the effects of rising inflation, and thus, are less sensitive to worsening economic conditions.American Express has generated impressive growth in recent years as cardholder spending has hit record levels. Last year, Amex reported $60.4 billion in revenue, which was 15% higher than in the previous year and 40% more than the $43.1 billion it reported in 2021. And with net income totaling $8.3 billion in 2023, the company also generates strong, double-digit profit margins.Amex's business hasn't been slowing down and neither has the stock. If you invested $10,000 into the business a decade ago, your investment would now be worth nearly $31,000 (including dividends), slightly outperforming Bank of America during that timeframe.By investing $30,000 across these three stocks a decade ago, you would have a profit of $128,000 -- thanks largely in part to Apple's gains. But all of these stocks have been phenomenal investments over the years and with strong financials and more growth opportunities still ahead, there's plenty of reason to remain bullish on them for the foreseeable future.Should you invest $1,000 in Apple right now?Before you buy stock in Apple, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $537,557!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of April 22, 2024Bank of America is an advertising partner of The Ascent, a Motley Fool company. American Express is an advertising partner of The Ascent, a Motley Fool company. David Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, Berkshire Hathaway, Mastercard, and Visa. The Motley Fool recommends the following options: long January 2025 $370 calls on Mastercard and short January 2025 $380 calls on Mastercard. The Motley Fool has a disclosure policy.If You Invested $10,000 in Warren Buffett's Top 3 Stocks 10 Years Ago, This Is How Much You'd Have Today was originally published by The Motley FoolView comments"
    }
]