[
    {
        "title": "Magnificent Seven Stocks: Nvidia Stock Surges Above Key Level; Tesla Slides",
        "url": "https://finance.yahoo.com/m/4205eaa9-f620-3a0b-a81a-0e82c7c9fd0b/magnificent-seven-stocks%3A.html",
        "content": "Magnificent Seven stocks, including AI leader Nvidia, are among the best stocks to watch in today's stock market. Continue reading View comments"
    },
    {
        "title": "3 Stocks to Invest $30,000 in Right Now",
        "url": "https://finance.yahoo.com/m/3be9e033-2c01-373c-a3f3-18732f453ceb/3-stocks-to-invest-%2430%2C000-in.html",
        "content": "Tech stocks have a long reputation for providing consistent and significant gains over the long term, proven by the Nasdaq-100 Technology Sector's 395% rise over the last 10 years.The industry's ever-expanding nature is driven by reliable demand for upgrades to various hardware and software products. So, it's unsurprising that investing mogul Warren Buffett's holdings company, Berkshire Hathaway, has dedicated more than 40% of its portfolio to tech stocks. Meanwhile, Berkshire's holdings posted a compound annual gain of nearly 20% between 1965 and 2023.As a result, it could be worth following suit and making a sizable long-term investment in the high-growth sector. So, here are three stocks to invest $30,000 in right now -- $10,000 for each.1. Advanced Micro DevicesAdvanced Micro Devices (NASDAQ: AMD) business has exploded over the last decade, taking on a leading role in the chip market.A decade ago, the company was on the brink of bankruptcy, bleeding money alongside mounting debt. Then, in 2014, Lisa Su became AMD's CEO, triggering one of the most impressive turnarounds in the tech market's history.The launch of its Ryzen line of central processing units (CPUs) in 2017 has been a major growth catalyst, with AMD's CPU market share rising from 18% in the first quarter of 2017 to 33% in 2024. The company has gradually chipped away Intel's share, which fell from 82% to 64% in the same period.AMD ChartShares in AMD have soared 3,500% over the last 10 years. As a result, an investment of $10,000 in AMD's stock in 2014 would be worth more than $357 billion today.Of course, past growth doesn't always indicate what's to come. However, the company has an exciting outlook that could deliver major gains over the next 10 years. AMD is investing heavily in artificial intelligence (AI), launching new AI graphics processing units (GPUs) this year and investing in AI personal computers.The AI market hit nearly $200 billion last year and is projected to reach nearly $2 trillion by 2030. Alongside positions in other areas of tech, such as cloud computing, video games, and consumer PCs, AMD will likely continue benefiting from the tailwinds of tech for years.Consequently, an investment of $10,000 in AMD's stock over the next decade could deliver significant gains.2. AmazonIt's impossible to deny Amazon's (NASDAQ: AMZN) potent role in tech. Thanks to its popular e-commerce site, the company has built up immense brand loyalty worldwide. Amazon's retail site is available in over 20 countries and ships to more than 100 nations.Story continuesThe success of Amazon's e-commerce business has seen annual revenue climb 546% since 2014, with operating income skyrocketing by more than 20,000%.Amazon's meteoric rise is primarily owed to its lucrative Prime membership. Its subscription-based model bundles multiple services, including free expedited shipping on its retail site, video streaming, music, gaming, and more. Including multiple services makes consumers less likely to unsubscribe, leading to a global subscriber count above 230 million.AMZN ChartShares in Amazon have risen 926% since 2014, meaning an investment of $10,000 back then would be worth over $102,000 today. And the company could potentially beat that growth over the next 10 years.In addition to consistent retail growth, Amazon is rapidly expanding in AI and cloud computing. On April 25, the company announced plans to invest $11 billion to build data centers in Indiana to grow Amazon Web Services (AWS).The company is on a promising growth path, and if you have the means, it could be worth an investment of $10,000 this month. However, a smaller investment is still worth considering.3. AppleApple (NASDAQ: AAPL) is easily one of the most successful companies in tech history. Its market cap of $2.6 billion makes it the world's second-most-valuable company (only after Microsoft). Meanwhile, Apple's vast and loyal user base has allowed it to achieve leading market shares in multiple product categories.However, the company has stumbled over the last year. Macroeconomic headwinds led to repeated quarters of revenue declines in 2023. Apple's Q1 2024 seemed to break the streak, with revenue rising 2% year over year.Meanwhile, the tech giant's free cash flow hit $107 billion, significantly more than Microsoft, Amazon, or Alphabet. The considerable difference could suggest Apple is best equipped to keep investing in its business and come back strong in the coming years.AAPL ChartApple's stock has increased by 738% over the last decade. Consequently, a $10,000 investment in its shares 10 years ago would be worth nearly $84,000 today.Moreover, like AMD and Amazon, Apple is taking on AI head-on. Over the last year, the company has gradually added AI-driven features across its product range, with plans to overhaul its MacBook lineup to focus on AI. The company also recently acquired French AI company Datakalab, which specializes in on-device processing.Apple's dominating role in tech and exciting outlook could make it worth investing $10,000 in its stock, with plans to hold for at least a decade.Should you invest $1,000 in Advanced Micro Devices right now?Before you buy stock in Advanced Micro Devices, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $537,557!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of April 22, 2024Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, and Microsoft. The Motley Fool recommends Intel and recommends the following options: long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy.3 Stocks to Invest $30,000 in Right Now was originally published by The Motley FoolView comments"
    },
    {
        "title": "Dow Jones Futures: Nvidia Leads 7 New Buys As Market Roars; Fed, Apple, Super Micro Loom",
        "url": "https://finance.yahoo.com/m/ae13c909-3596-347c-9707-4eb73495cacb/dow-jones-futures%3A-nvidia.html",
        "content": "Nvidia and several other leaders flashed buy signals as the market roared. Investors should take advantage, but it's a jungle out there. Continue reading View comments"
    },
    {
        "title": "Divest-or-Ban Law Rattles TikTok Influencers Pushing Pro-Biden Content",
        "url": "https://finance.yahoo.com/news/divest-ban-law-rattles-tiktok-120022569.html",
        "content": "(Bloomberg) -- When President Joe Biden returned to the White House after delivering his State of the Union address, 23-year-old TikTok influencer Awa Sanneh joined roaring cheers alongside administration staffers gathered on the mansion’s back porch.Most Read from BloombergApple Intensifies Talks With OpenAI for iPhone Generative AI FeaturesPlunging Home Prices, Fleeing Companies: Austin’s Glow Is FadingWall Street Humbled as Fast-Reversing Markets Confound the ProsThe Long, Slow Death of Urban NightlifeBHP’s $39 Billion Copper Play Was Years in the MakingBiden told the group “how important” social media content is to reach Gen-Z voters, recalled Sanneh, among dozens of creators invited for a watch party that night.Just weeks later, Biden signed into law a bill that forces TikTok’s parent company, Beijing-based ByteDance Ltd., to sell its stake or face a ban in US app stores. That has rattled the social media creators his campaign has taken unprecedented steps to court.“I’m pretty critical of him at this moment in time,” said Sanneh, who has attended multiple administration briefings and has more than 510,000 followers. “If you truly understood the impact, then you would want to keep TikTok.”Biden’s embrace of the divest-or-ban bill exemplifies his efforts to contain what administration officials and lawmakers from both parties see as a growing national-security threat from China. Nonetheless, he continues to promote his political message on the platform.None of the influencers who spoke to Bloomberg News said Biden had lost their vote. However, the new law is likely to turn off younger voters, who've propelled the app to mainstream relevance and are key to Democratic electoral wins. Many are already unenthusiastic about Biden’s reelection.“Election after election, young people continue to show us they understand the stakes of this moment, and will vote like their futures depend on it – because they do,” said Seth Schuster, a spokesperson for Biden’s campaign.Kenny Walden, who has 167,000 TikTok followers and has attended White House events, posted a video on the platform expressing confusion over Biden’s decision to back the bill over privacy and data security concerns.@2rawtooreal2My thoughts havent changed on the tiktok ban♬ original sound - 2RawTooReal“I’m against it, Joe,” said Walden, whose content focuses on encouraging people to vote for Biden. The president is silencing his “frontline of defense,” he added, referring to creators like him.Opponents of the bill say it threatens freedom of speech and singles out the social-media platform over others collecting users’ data.Story continuesWhite House officials maintain their intention isn’t to prohibit TikTok from operating, but to force the app’s Chinese owner to divest. The 270-day deadline for ByteDance extends beyond November, allowing users to continue posting through the election.“This is about our national security. This is not concerns about Americans using Tiktok,” said White House Press Secretary Karine Jean-Pierre. “There’s certainly time on the books to see how this plays out.”Earlier: TikTok Ban in US Looms as Biden Kicks Off 270-Day CountdownByteDance has made clear it has no intention of selling, and a protracted legal battle is likely. At the same time, Donald Trump is already using the prospect of a ban to court younger voters. In a social media post before the bill passed Congress, he blamed Biden for setting a ban in motion. That marked a reversal for Trump, who as president signed an order in 2020 banning the app that was later overturned in court.Biden’s team says its presence on the app is a vital part of a strategy to reach voters in as many arenas as possible. The app’s reach is massive: More than 170 million Americans have accounts, the company says, and a third of adults under 30 get their news from it, according to the Pew Research Center.Earlier: Biden’s Campaign to Stay on TikTok Despite Divestment LawIn a first-of-its-kind push for a presidential administration, Biden’s aides are in touch daily with social media influencers or their managers. Meanwhile, campaign officials are considering bringing creators into their headquarters, said a person familiar with the deliberations.The campaign’s partnerships with popular creators are all the more important since TikTok prohibits political advertising. Organizing multiple people to push positive content beats Biden’s presence alone on the app, according to a person with knowledge of the strategy.Never miss an episode. Follow the Big Take DC podcast on iHeart, Apple Podcasts, Spotify or wherever you listen. Read the transcript.The Biden campaign launched a TikTok account during the Super Bowl in February. It has more than 300,000 followers, which pales in comparison to those of the most popular influencers. The campaign is taking at least one known security precaution: Staffers post on the app from one separate device.Biden officials were already facing a daunting landscape on TikTok, even before he signed the divest-or-ban bill. Negative posts about the 81-year-old president proliferate on the platform, driven by frustration over his handling of the war in Gaza, his age and climate policies.“It’s very anti-Biden,” Kerry Robertson, a Minneapolis-based influencer who supports Biden, said of TikTok. “It always has been.”“Even though the algorithm isn't showing me any kind of pro-Biden content or anything like that, whenever I do those videos, I get a lot of ‘Thank you for this,'\" she added.Earlier: Primaries Show Candidates Can Win on TikTok But Lose at the PollsThere is no clear evidence TikTok’s algorithm has a particular political bent, according to Neta Kligler-Vilenchik, a Hebrew University of Jerusalem associate communication professor. But since it’s notoriously opaque, it presents a “problem” for those seeking to understand its growing political influence, said Columbia University associate communications professor Ioana Literat.“Look what's happening on TikTok,” Biden said recently at a fundraiser. “It’s so easy to just flat-out lie and not know what’s true, so we got a lot at stake here.”It’s difficult to measure the volume of positive or negative sentiment about Biden on TikTok because the company restricts certain data. Users are often siloed in different content universes, where their feeds reflect topics they interact with the most, experts say.Biden’s team is making the calculus that they can persuade disenchanted voters to consider supporting him, in part through online content.Before Biden’s Radio City Music Hall fundraiser in March, which featured comedian Stephen Colbert and former Presidents Bill Clinton and Barack Obama, some TikTok creators joined a roundtable with campaign staffers about digital strategy, where Biden stopped by to speak with them, one influencer recapped in a video.@claaaarkeseeing biden, obama, clinton + queen latifah in one day? high school clarke is screaming ????♬ Calm (Lofi) - Faneo soundFinnegan Biden, Biden's granddaughter, also hosted a happy hour for creators at nearby Pebble Bar before the fundraiser.Similar to the Radio City event, behind-the-scenes visits to the White House are great fodder for social media. \"Look at this — this napkin has the seal of the president on it,\" Sanneh said in a video inside a White House bathroom that drew 2.1 million views.@_awasannehDear Awa-Topia (the name is a work in progress- shush): your unwavering support has been the heartbeat of my journey. Your passion fuels my creativity, and your dedication lights up my darkest days. Thank you for being the foundation of this incredible life I get to live. Thank you for supporting this slightly off- putting, wierd, black girl from Texas. Gratitude flows from every corner of my heart to yours.♬ original sound - AwaIf TikTok goes away, so does a source of influencers’ revenue. Harry Sisson, a 21-year-old who has joined both official and campaign gatherings, is encouraging his 850,000 TikTok followers to watch videos on his YouTube channel, where he has been posting more because of the potential ban.“There are a lot of creators on TikTok who support them and have done a lot of work for the campaign and the president,” Sisson said in an interview. “I’m overall disappointed.”--With assistance from Alex Barinka.(Updates with details about opposition to bill in ninth paragraph)Most Read from Bloomberg BusinessweekUS White-Collar Job Growth Stalls, Even in Pandemic BoomtownsCaught Between the US and China, a Powerful AI Upstart Chooses SidesHow North Korea’s Man in the West Ran Afoul of US AuthoritiesHow a Massive Hack of Psychotherapy Records Revealed a Nation’s SecretsStudio Behind Dune Eyes Growth, Even Without a Paramount Merger©2024 Bloomberg L.P.View comments"
    },
    {
        "title": "Goldman Sachs’ Top 15 Stock Picks for 2024",
        "url": "https://finance.yahoo.com/news/goldman-sachs-top-15-stock-125416704.html",
        "content": "In this article, we'll take a look into Goldman Sachs' top 15 stock picks for 2024. If you prefer to skip the introduction about the investment bank and its recent business developments, you can just dive straight into Goldman Sachs' Top 5 Stock Picks for 2024.Established in 1869 by German immigrant Marcus Goldman, Goldman Sachs has evolved into the world's second-largest investment bank by revenue, amassing $1.65 billion in fees during the first quarter of 2024. From its modest origins in a one-room basement office adjacent to a coal chute, the bank has expanded steadily over the years. In 1906, it made its mark in the initial public offering (IPO) market with the iconic Sears, Roebuck, & Co. Goldman Sachs was among the pioneers in emphasizing price-to-earnings (P/E) ratios over book values for company valuation.Banks are intricately linked to the fluctuations in interest rates due to their core function of dealing with money. While consumers may lament higher rates, banks often welcome them as they can widen their profit margins, known as the 'spread,' even amidst reduced borrowing demand during tighter monetary conditions. However, higher interest rates can challenge banks to manage their asset base, including funds invested in securities like bonds. Sharp rate fluctuations necessitate the revaluation of these securities, potentially resulting in losses that could jeopardize the stability of even the most profitable of banks. This was evident in the US banking crisis of 2023, particularly impacting Goldman Sachs, which reported a substantial $470 million loss in its loan portfolio during the first quarter of that year. This loss was part of the bank's efforts to restructure its retail banking division in response to the challenging environment.Despite grappling with such challenges a year ago as it ventured into Main Street endeavors, Goldman Sachs came back strong by refocusing on its core strengths. In the first quarter of this year, it surpassed analyst expectations by nearly $1 billion, garnering close to $4 billion in earnings, largely driven by substantial profits in its trading and corporate advisory divisions. While analysts anticipated a turnaround in deal-making activities, Goldman Sachs exceeded this forecast. Notably, the bank's investment banking fees soared by an impressive 32% in the latest results, reaching $2.08 billion. Additionally, the consumer banking division reported a noteworthy 24% revenue growth, marking a refreshing change after years of costly losses and write-downs.Story continuesDespite the investment bank's surge in revenues, its net provisions for litigation and regulatory matters were a mere $23 million for the first quarter of 2024, a notable reduction compared to the previous year. Additionally, Goldman Sachs trimmed its workforce by 2% following the sale of home lending firm GreenSky in October. This divestiture aligns with the bank's recent strategic shift away from consumer banking to prioritize its core offerings: Global Banking & Markets and Asset & Wealth Management. Despite incurring a $506 million loss from the sale in 2023, CEO David Solomon remains optimistic, citing the resurgence of capital markets and promising business prospects in Goldman's core sectors as the catalysts for the bank's turnaround. These results were especially gratifying for the bank, coming shortly after rival JPMorgan Chase & Co. (NYSE:JPM) experienced its sharpest stock decline in almost four years, acknowledging a more challenging outlook than previously expected.Curious about Goldman Sachs' outlook for the future? Here's a glimpse into what its management said during its first-quarter 2024 earnings call:In debt capital markets, tighter spreads have contributed to a constructive issuance environment and investment grades with volumes hitting a record for the first three months of the year. Additionally, refinancing was a major theme with robust high-yield and institutional loan refinancing volumes. Given a more accommodative issuance backdrop as well as the potential for increased acquisition financing, alongside higher M&A activity, we expect solid levels of debt underwriting activity to continue this year. With our long-standing leadership positions across the global capital markets, we have been at the forefront in helping our clients access the markets and our firm stands to benefit further as transaction volumes rise from the 10-year lows.It’s important to note that alongside the reopening, we are seeing in capital markets, our intermediation businesses continue to be active in supporting our clients’ needs. And we’re growing financing revenues across FICC and Equities, which together were a record this quarter and rose 18% sequentially. All-in, our top-tier intermediation franchise, and more durable financing results are helping raise the floor in global banking and markets. In Asset & Wealth Management, assets under supervision rose to a new record of $2.8 trillion this quarter, which represented our 25th consecutive quarter of long-term fee-based net inflows. We have a diversified platform across public and private markets and are delivering solid performance across asset classes, and we continue to invest resources in growing this business, particularly across Wealth Management, Alternatives, and Solutions.Amidst a backdrop of cautious optimism brewing at JPMorgan, we've scrutinized its leading stock selections. Noteworthy among them are Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA).Goldman Sachs' Top 15 Stock Picks for 2024Our MethodologyTo compile our roster of Goldman Sachs' top stock picks for 2024, we reviewed the bank's submissions to the SEC, pinpointing its 15 most substantial investment holdings. Our evaluation process also incorporates insights from Insider Monkey's repository of 933 hedge funds, as of the final quarter of 2023. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator.15. Costco Wholesale Corporation (NASDAQ:COST)Goldman Sachs' Q4 2023 Investment Value: $2.27 billionNumber of Hedge Fund Holders: 57Costco Wholesale Corporation (NASDAQ:COST) operates a global network of membership warehouses renowned for offering high-quality, brand-name products at significantly lower prices than traditional retail outlets. As of April 25, the company provides a quarterly dividend of $1.15 per share, equating to a dividend yield of 0.64%. Impressively, Costco Wholesale Corporation (NASDAQ:COST) has consistently increased its dividend for the past 19 years, underscoring its commitment to rewarding shareholders.Insider Monkey's data reveals that Costco Wholesale Corporation (NASDAQ:COST) was held in 57 hedge fund portfolios at the end of Q4 2023, down from 65 in the previous quarter. Nevertheless, these hedge funds' stakes in Costco have a combined value exceeding $4 billion.Much like Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA), Costco Wholesale Corporation (NASDAQ:COST) ranks as one of Goldman Sachs' top stock picks.14. Accenture plc (NYSE:ACN)Goldman Sachs' Q4 2023 Investment Value: $2.34 billionNumber of Hedge Fund Holders: 58Accenture plc (NYSE:ACN) is a leading American multinational professional services company, providing consulting, technology, and outsourcing services to its clients. On March 21, the company announced a quarterly dividend of $1.29 per share, consistent with its previous dividend payments. Notably, Accenture plc (NYSE:ACN) has maintained a consistent dividend record since 2005 and has increased its payouts at an average annual rate of 12.33% over the past five years.In the fourth quarter of 2023, Insider Monkey's database revealed that 58 hedge funds held stakes in Accenture plc (NYSE:ACN), up from 55 in the previous quarter. The combined value of these holdings amounted to approximately $2.4 billion. GuardCap Asset Management emerged as the company's top stakeholder in Q4.13. Broadcom Inc. (NASDAQ:AVGO)Goldman Sachs' Q4 2023 Investment Value: $2.5 billionNumber of Hedge Fund Holders: 91Based in California, Broadcom Inc. (NASDAQ:AVGO) is a prominent American company specializing in semiconductor and infrastructure software products. The company derives a significant portion of its revenue from semiconductor-based products.In March, TD Cowen upgraded Broadcom Inc. (NASDAQ:AVGO) shares from Market Perform to Outperform and raised the share price target to $1,500 from $1,400.Insider Monkey examined 933 hedge fund portfolios for their shareholdings in the December quarter of 2023 and identified 91 stakeholders in Broadcom Inc. (NASDAQ:AVGO). Ken Fisher’s Fisher Asset Management held the largest stake, valued at $2.3 billion.12. Eli Lilly and Company (NYSE:LLY)Goldman Sachs' Q4 2023 Investment Value: $2.72 billionNumber of Hedge Fund Holders: 102Established in 1876, Eli Lilly and Company (NYSE:LLY) is a prestigious American pharmaceutical firm headquartered in Indianapolis, Indiana. Named after its founder, Colonel Eli Lilly, a pharmaceutical chemist and veteran of the Civil War, the company boasts a global presence, with operations in 18 other countries. Eli Lilly and Company (NYSE:LLY) currently distributes a quarterly dividend of $1.30 per share and has consistently increased its dividends over the past decade. Moreover, the company has an impressive history of paying dividends uninterrupted for 138 years. As of April 25, the stock offers a dividend yield of 0.72%.By the end of December 2023, 102 out of the 933 hedge funds analyzed by Insider Monkey had acquired and retained shares of the company. Among these, Ken Fisher’s Fisher Asset Management held the largest stake in Eli Lilly and Company (NYSE:LLY), valued at $2.6 billion.11. Berkshire Hathaway Inc. (NYSE:BRK-B)Goldman Sachs' Q4 2023 Investment Value: $2.8 billionNumber of Hedge Fund Holders: 117Berkshire Hathaway Inc. (NYSE:BRK-B), headquartered in Omaha, Nebraska, is a diversified multinational conglomerate holding firm primarily operating in the insurance sector. The company leverages the capital generated from insurance operations to invest in a wide range of subsidiaries, equity holdings, and securities across various industries. This diversified portfolio enables Berkshire Hathaway Inc. (NYSE:BRK-A) to maintain resilience in the face of challenges such as high interest rates.In the fourth quarter of the previous year, 117 out of the 910 hedge funds analyzed by Insider Monkey had invested in Berkshire Hathaway Inc. (NYSE:BRK-B). Among these investors, the largest shareholder was Michael Larson’s Bill & Melinda Gates Foundation Trust, which held 19.9 million shares valued at $7.1 billion.10. UnitedHealth Group Incorporated (NYSE:UNH)Goldman Sachs' Q4 2023 Investment Value: $2.95 billionNumber of Hedge Fund Holders: 113Based in Minnetonka, Minnesota, UnitedHealth Group Incorporated (NYSE:UNH) is a prominent American multinational corporation specializing in managed healthcare and insurance services. The corporation operates for profit and is structured into four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx.On April 16, UnitedHealth Group Incorporated (NYSE:UNH) released its first-quarter earnings report. The company posted a non-GAAP EPS of $6.91, exceeding estimates by $0.29. Revenue grew by 8.6% year-over-year to $99.79 billion, surpassing market estimates by $490 million.In the fourth quarter of 2023, 113 hedge funds held stakes in UnitedHealth Group Incorporated (NYSE:UNH), with total positions valued at $11.198 billion. This marks an increase from the preceding quarter, which saw 104 funds with positions valued at $10.95 billion. As of December 31, 2023, GQG Partners held the largest stake in the company, valued at $1.8 billion.UnitedHealth Group Incorporated (NYSE:UNH) joins the ranks of Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA) as one of Goldman Sachs' top stock picks.9. JPMorgan Chase & Co. (NYSE:JPM)Goldman Sachs' Q4 2023 Investment Value: $3.08 billionNumber of Hedge Fund Holders: 103Headquartered in New York, JPMorgan Chase & Co. (NYSE:JPM) operates globally across various sectors, including Consumer & Community Banking, Corporate & Investment Bank, Commercial Banking, and Asset & Wealth Management.On March 13, RBC Capital analysts maintained an Outperform rating on JPMorgan Chase & Co. (NYSE:JPM) with a price target of $185.Insider Monkey's analysis of 933 hedge fund holdings for their fourth quarter of 2023 shareholdings revealed that 103 had invested in the bank. Notably, Ken Fisher’s Fisher Asset Management held the largest stake in JPMorgan Chase & Co. (NYSE:JPM), valued at $2 billion.Carillon Tower Advisers said the following about JPMorgan Chase & Co. (NYSE:JPM) in its fourth-quarter 2023 investor letter:“PNC Financial and JPMorgan Chase & Co. (NYSE:JPM) performed well due to more benign inflation data, which the market likely interpreted as a sign that a recession is now less likely to occur. Recall that historically speaking, banks are hyper-cyclical stocks and typically will trade lower if investors foresee a recession, because recessions tend to trigger loan losses.”8. Meta Platforms, Inc. (NASDAQ:META)Goldman Sachs' Q4 2023 Investment Value: $3.96 billionNumber of Hedge Fund Holders: 242Headquartered in the United States, Meta Platforms, Inc. (NASDAQ:META) is a renowned multinational technology company recognized for its social networking services and advertising solutions, which span platforms such as Facebook, Instagram, Threads, and WhatsApp.On April 9, TD Cowen analyst John Blackledge reaffirmed a Buy rating on Meta Platforms, Inc. (NASDAQ:META) and increased its price target by $90 to $590. Additionally, TD Cowen raised the company’s revenue estimates for the first quarter of 2024 and the years 2024-2029 by 1%-4% annually.Insider Monkey's examination of 933 hedge fund holdings for their fourth quarter of 2023 shareholdings revealed that 242 had invested in Meta Platforms, Inc. (NASDAQ:META). Notably, Rajiv Jain’s GQG Partners held the largest stake, valued at $3.9 billion.7. Tesla, Inc. (NASDAQ:TSLA)Goldman Sachs' Q4 2023 Investment Value: $4.09 billionNumber of Hedge Fund Holders: 82Headquartered in Austin, Texas, Tesla, Inc. (NASDAQ:TSLA) is a leading manufacturer of fully electric vehicles and energy solutions. Their diverse product lineup includes popular models like the Model 3 and Model S sedans, Model Y and Model X SUVs, along with upcoming innovations such as the Cybertruck, Tesla Roadster, and Tesla Semi for light commercial use.Insider Monkey's analysis of hedge fund holdings at the end of December 2023 revealed that 82 out of 933 profiled hedge funds had invested in Tesla, Inc. (NASDAQ:TSLA). Notably, Philippe Laffont's Coatue Management emerged as the company's largest hedge fund shareholder, with a substantial $1 billion investment.Tesla, Inc. (NASDAQ:TSLA) was mentioned by Tsai Capital Corporation in its fourth-quarter 2023 investor letter. Here is what the firm commented:“Tesla has significant and underappreciated competitive advantages across multiple verticals including electric vehicles, software and energy storage. Misunderstood by much of Wall Street – and consequently a favorite of short sellers – Tesla continues to grow rapidly and increase its lead over the competition while delighting consumers in the process. [. . .] While we expect competition for EVs to intensify and for Tesla to lose market share over time, we also believe the company will increase production and deliveries from approximately 1.8 million vehicles today to approximately 15 million vehicles in 2030 and further its lead in autonomous driving capability. In fact, we expect Tesla will eventually license its autonomous driving software, creating high-margin (70-80%), recurring licensing revenue. Tesla is also one of only two companies that dominate the energy storage market, which has the potential to grow to several hundred billion in revenue as power plants around the world increase their focus on renewable energy.”6. Visa Inc. (NYSE:V)Goldman Sachs' Q4 2023 Investment Value: $4.8 billionNumber of Hedge Fund Holders: 162Visa Inc. (NYSE:V) is a financial services firm renowned for its provision of debit cards, credit cards, and associated services. With a robust global payment network, Visa (NYSE:V) stands out in the e-commerce sector, facilitating secure and efficient online transactions.Recently, on April 3, Visa Inc. (NYSE:V) unveiled its latest offering, Subscription Manager, as part of its Digital Enablement product suite. This service empowers financial institutions to offer cardholders a streamlined method to monitor their subscriptions directly through their banking apps.Insider Monkey's analysis of fourth-quarter 2023 shareholdings revealed that 162 out of 933 tracked hedge funds had invested in Visa Inc. (NYSE:V). Notably, Chris Hohn's TCI Fund Management held the largest stake, valued at $4.3 billion.In addition to Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA), Visa Inc. (NYSE:V) is one of Goldman Sachs' top stock picks for 2024.Click to continue reading and see Goldman Sachs' Top 5 Stock Picks for 2024.Suggested Articles:10 Unstoppable Stocks That Will Make You Richer10 Most Undervalued Value Stocks To Buy Now25 Biggest Social Media Companies and Platforms for AdvertisersDisclosure. None. Goldman Sachs' Top 15 Stock Picks for 2024. was initially published on Insider Monkey.View comments"
    },
    {
        "title": "3 Top Warren Buffett Stocks to Buy in This Bull Market",
        "url": "https://finance.yahoo.com/m/c1d84336-4020-316f-a5e4-7c9d85a97b79/3-top-warren-buffett-stocks.html",
        "content": "Since bottoming out in 2022, the S&P 500 index has rocketed to new highs. While no one knows how long this run will last, history shows bull markets tend to last for longer stretches than when the market falls.Of course, Warren Buffett isn't fazed by these ups and downs. He focuses on investments in solid companies that he believes will grow in value over many years.Berkshire Hathaway's stock portfolio is full of outstanding businesses. Three Fool.com contributors recently selected their favorite stocks from Berkshire's holdings. Here's why they believe Apple (NASDAQ: AAPL), Lennar (NYSE: LEN), and Amazon (NASDAQ: AMZN) are solid buys right now.One of the strongest brands in the worldJohn Ballard (Apple): Apple stock has underperformed so far in 2024. Investors appear concerned about slowing iPhone sales in China and regulatory headwinds. But none of these obstacles impact Apple's ability to deliver growth and reward shareholders over the long term.Apple was still Berkshire Hathaway's largest investment at the end of 2023, with a stake worth $174 billion. Buffett said a year ago that Apple was a better business than any Berkshire owned -- a significant statement, considering the incredible returns Berkshire has delivered over the years.The dip is a good buying opportunity ahead of a potentially strong growth period for Apple. The company is reportedly spending up to $1 billion per year on generative artificial intelligence (AI) technology. It is widely speculated that Apple may release new AI features for its iOS software as early as this year.Over the next decade, AI could be game-changing for the customer experience, including potential implementation in AppleCare and Apple's productivity apps like Pages and Numbers.Apple has all the cash it needs to continue improving its products. The company generated $107 billion in free cash flow over the last year, and it will keep growing as it sells more devices around the world.Apple's installed base of active devices continues to hit new highs, now over 2.2 billion. While market participants focus on weak iPhone sales in China, Apple is still on the move everywhere else.This homebuilder still looks promisingJeremy Bowman (Lennar): Berkshire Hathaway surprised investors last year by going long on homebuilder stocks. Buffett (through Berkshire) purchased D.R. Horton, NVR, and Lennar. The conglomerate has since sold D.R. Horton, the country's largest homebuilder, but it still retains small positions in Lennar and NVR.While both of those stocks are worth buying, Lennar is cheaper than NVR and is more similar to D.R. Horton, which just reported a strong quarterly earnings report, showing that demand for new homes remains strong, and profits continue to flow into the sector.Story continuesWe won't get another quarterly update from Lennar until June, but the company looks to be in a good position to benefit from the same trends, including elevated interest trades, a lack of inventory in existing homes, and an estimated housing shortage of 4 million due to restrictive zoning laws and years of chronic underbuilding. Those factors have all contributed to elevated home prices, which is also a boon for homebuilders like Lennar.In its first-quarter earnings report, Lennar reported 12.6% revenue growth, which drove earnings up 21% to $719 million, and earnings per share rose 25% to $2.57 as management has taken advantage of the low stock price to buy back stock. Over the last year, the company has reduced shares outstanding by about 3.5%.Lennar also reported growth in all four of its regions, showing broad-based demand and execution. New orders increased 28% to 18,176 homes, showing healthy and growing demand.With interest rates now expected to remain \"higher for longer,\" Lennar is in a good position to capitalize on the housing crunch and macro environment, and the stock looks cheap at a price-to-earnings ratio of just 11.Lennar looks like a good bet to move higher as it capitalizes on the demand for new homes.Buffett's bet was late, but still profitableJennifer Saibil (Amazon): Buffett isn't known for buying technology stocks, and he acknowledged that he was late to the game when Berkshire finally invested in Amazon in 2019, 20 years after it became a public company.Amazon had already minted millionaires, but that didn't deter Buffett from buying at that point. Buffett is all about patient investing, and he preferred to buy Amazon once it had a proven track record and strong profits while still offering tremendous opportunities.Buffett didn't buy Amazon for exposure to artificial intelligence (AI), and he probably wouldn't buy stocks today just to benefit from emerging trends. That might be part of the lesson in Buffett's investing approach: When you buy stock in great companies, you'll end up winning from these kinds of future opportunities, which Amazon has in abundance.Amazon is the second-largest company in the U.S. by sales, but its growth story still looks incredibly compelling. It's the largest e-commerce company in the U.S. by a wide margin, and e-commerce is growing faster than overall retail. It has made structural changes to its e-commerce infrastructure that speed up deliveries at lower costs, and that should enhance its dominant position as well as pad profitability.Amazon is also the leading cloud services provider, and its AI tools for code developers and Amazon Web Services (AWS) clients reinforce its lead against a growing cadre of competitors. Amazon is investing in this groundbreaking technology, and it has a long, open runway in this growth story.Digital advertising has become Amazon's fastest-growing segment, and this high-margin business is another lever it's pushing to increase sales. Its AI tools for advertisers, as well as the ability for advertisers to reach customers as they shop, make Amazon a no-brainer platform for ads.Growth stocks tend to perform well in bull markets, and Amazon is already up 75% over the past year.Should you invest $1,000 in Apple right now?Before you buy stock in Apple, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $506,291!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of April 22, 2024John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Jennifer Saibil has no position in any of the stocks mentioned. Jeremy Bowman has positions in Amazon. John Ballard has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon, Apple, Berkshire Hathaway, Lennar, and NVR. The Motley Fool has a disclosure policy.3 Top Warren Buffett Stocks to Buy in This Bull Market was originally published by The Motley FoolView comments"
    },
    {
        "title": "This Is the Only FAANG Stock Lawmakers on Capitol Hill Were Net Buyers of Last Year",
        "url": "https://finance.yahoo.com/m/adb5df9c-a4a9-364e-a974-822c2f3d0da6/this-is-the-only-faang-stock.html",
        "content": "Of the 535 members of Congress, 100 bought or sold stocks in 2023, according to options trading platform Unusual Whales. One-third of them outperformed the S&P 500.With FAANG stocks skyrocketing in 2023, you might think representatives and senators loaded up on the widely followed growth stocks. But that wasn't the case. Lawmakers on Capitol Hill were net buyers of only one FAANG stock last year.The Apple of politicians' eyesApple (NASDAQ: AAPL) turned out to win the votes of politicians in 2023. Representatives and senators bought $2.4 million of the tech stock, enough to land it in the No. 2 spot, narrowly trailing ConocoPhillips. Apple also ranked fifth among stocks traded by members of Congress based on number of shares.Twenty lawmakers traded Apple last year. This made the stock slightly less popular than Microsoft and JPMorgan Chase with 23 and 21 members of Congress trading each stock, respectively.Apple buyers on Capitol Hill included Rep. Ro Khanna, a California Democrat and the most active trader by far among members of Congress. Former House Speaker Nancy Pelosi, another California Democrat, also aggressively scooped up shares of the iPhone maker.The stock wasn't just attractive to Democrats, though. Republican representatives Dan Newhouse of Washington, Blake Moore of Utah, and Michael Guest of Mississippi bought Apple. So did GOP senators Shelley Moore Capito of West Virginia and Markwayne Mullin of Oklahoma.Why just Apple?It makes sense that Apple was a top pick for lawmakers -- it was the biggest company in the world based on market cap in 2023 and has been one of the most popular stocks among all investors for years. What is surprising, though, is that Apple was the only FAANG stock for which members of Congress were net buyers.Facebook parent Meta Platforms generated much greater returns last year than Apple, with the social media stock nearly tripling. But politicians didn't jump on the bandwagon for some reason.Amazon, Netflix , and Google parent Alphabet also outperformed Apple. Again, representatives and senators weren't excited enough about these stocks to aggressively buy them.Perhaps politicians suffered from recency bias: the tendency to place more emphasis on recent experiences. In 2022, all of the FAANG stocks plunged. However, Apple fell much less than any of the others.META ChartIs Apple stock a smart pick now?So far in 2024, members of Congress are selling Apple stock much more than buying it. But is it a smart pick now?There are reasons to be skeptical about the stock. Apple's growth is lackluster. The company's revenue rose by only 2% year over year in its quarter ending Dec. 30, 2023. That's not enough growth to justify the stock's valuation (shares currently trade at a forward earnings multiple of 25.6).Story continuesRumors are flying that the early sales of Apple's new Vision Pro mixed-reality headset are disappointing. Analyst Ming-Chi Kuo wrote, \"Apple cut orders before launching Vision Pro in non-U.S. markets, which means that demand in the U.S. market has fallen sharply beyond expectations.\"On the other hand, Apple is expected to soon reveal new artificial intelligence (AI) innovations. CEO Tim Cook has hinted at a major announcement about AI this year. Cook said at the annual shareholder meeting in February that the company would \"break new ground\" in generative AI.Perhaps Apple's AI news will disappoint investors. It's possible, though, that new AI technology could set the stage for a \"supercycle\" of iPhone upgrades. If so, investors -- including members of Congress -- could be better off buying Apple than kicking the stock to the curb.Should you invest $1,000 in Apple right now?Before you buy stock in Apple, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $506,291!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of April 22, 2024Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. JPMorgan Chase is an advertising partner of The Ascent, a Motley Fool company. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Keith Speights has positions in Alphabet, Amazon, Apple, Meta Platforms, and Microsoft. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, JPMorgan Chase, Meta Platforms, Microsoft, and Netflix. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.This Is the Only FAANG Stock Lawmakers on Capitol Hill Were Net Buyers of Last Year was originally published by The Motley FoolView comments"
    },
    {
        "title": "Why Apple has a $300bn ‘Made in China’ problem",
        "url": "https://finance.yahoo.com/m/5621348f-1eb0-3613-83d3-31f89f13f2ba/why-apple-has-a-%24300bn-%E2%80%98made.html",
        "content": "Tim Cook is seen as the architect of Apple's 'made in China' strategy - NG HAN GUAN/AFPEight words were stamped on the back of every iPhone for years: “Designed by Apple in California. Assembled in China.” The slogan illustrated the tech giant’s two power bases: its headquarters in Silicon Valley, and the manufacturing colossus it had become in the world’s factory.Apple no longer features the words on the back of the iPhone. When the company launched a new supplier transparency website earlier this month, the phrase received an update: “Designed by Apple in California. Made by people everywhere.”Apple is gradually weaning itself off China as a longstanding and mutually-beneficial relationship between the corporate giant and the country begins to fray.Data released by the company last week, which outlined its relationships with hundreds of component and material providers, showed that while China remains the tech giant’s biggest single source of suppliers it is slowly turning elsewhere.Last year, 156 of 465 manufacturing sites used by Apple suppliers were in China – 33.6pc. This was down from 35.2pc and 36.4pc in 2022 and 2021 respectively, and 46pc five years earlier. The company is relying more heavily on supply chains in countries such as Vietnam, Taiwan and South Korea.The huge factories where those parts are turned into finished Apple products are largely based in China. But that too is changing.In 2022, Apple assembled just 5pc of iPhones and other gadgets outside China, according to JP Morgan. However, the company reportedly hopes to make a quarter of iPhones in India as soon as next year. Last year’s new iPhone models were the first manufactured in both India and China from launch day.Apple is not alone in seeking to move production away from China. Extended Covid lockdowns there during 2021 and 2022, as well as political pressure, have pushed manufacturers to look elsewhere. The American Chamber of Commerce in Shanghai found that last year that a fifth of US firms operating in the country were seeking to move manufacturing abroad, and two fifths were looking to redeploy investments originally planned for China.But Apple’s move is symbolic. The company has been a totem of “made in China” for almost a quarter of a century and Tim Cook, its chief executive, has been seen as the architect of that strategy.The shift is not just about manufacturing: Apple also faces growing concerns about its own business in the country.According to figures from research company Counterpoint, Apple lost its position as market leader by smartphone sales in China in the first quarter of the year, falling to third place behind domestic manufacturers Vivo and Honor.Story continuesIts share of the Chinese smartphone market fell by 19.1pc to 15.7pc – its lowest since 2020.The company has been squeezed by a resurgent Huawei, whose smartphone business came close to death but which has become a national champion after overcoming US sanctions to develop advanced microchips. Apple’s position has not been helped by Beijing telling government workers not to use iPhones and other foreign devices.On Thursday Apple is expected to report quarterly results confirming the concerns. Analysts forecast the company will report sales of $15.9bn (£12.8bn) in China, down 11pc year-on-year and the third consecutive quarterly drop.Concerns about Apple’s travails in China have seen the tech giant’s share price fall around 11pc so far this year, wiping more than $300bn off its market value.There are further clouds on the horizon. China is becoming an increasingly assertive online regulator, ordering Apple to remove WhatsApp and Meta’s Twitter rival, Threads, from its App Store in the country earlier this month.A US bill to ban the Chinese-owned app TikTok, signed by President Joe Biden last week, may increase pressure on Beijing to respond accordingly, perhaps by punishing an American company like Apple.Donald Trump, meanwhile, has said he will impose more tariffs on Chinese imports if he wins next year’s election. Those iPhones still assembled in China risk falling foul of those rules.If pressure builds on Apple to shift overseas more rapidly, it would not be easy, says Mark Zetter, an electronics industry consultant.“There’s nowhere else on earth currently that has the dynamics and the supply chain infrastructure that China has. For one destination to compete with China, I just don’t see that happening in my lifetime,” he says.Cook, for his part, has sought to keep the peace. “There’s no supply chain in the world that’s more critical to us than China,” he told the state-owned China Daily newspaper on a recent trip to the country. That will continue to be the case. But bit-by-bit, Apple is chipping away at its dependence on China.Broaden your horizons with award-winning British journalism. Try The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more.View comments"
    }
]