[
    {
        "title": "A Once-in-a-Generation Investment Opportunity: 1 Artificial Intelligence (AI) Stock to Buy Now and Hold Forever",
        "url": "https://finance.yahoo.com/m/514f3c45-2a0a-3955-b941-119b575f90ee/a-once-in-a-generation.html",
        "content": "One common theme among highly successful businesses is that they are constantly innovating. Microsoft (NASDAQ: MSFT) was founded nearly half a century ago. In that time, the company has evolved dramatically since revolutionizing personal computing.Today, Microsoft operates across a variety of end markets, including cloud computing, social media, gaming, and of course, artificial intelligence (AI).Although investors have myriad opportunities to invest in these areas, I'd argue that Microsoft is one of the few opportunities that actually succeeds in all the markets in which it operates. Moreover, as the AI revolution spells a new chapter in Microsoft's life cycle, I think the company is positioned to continue its dominant run.An ecosystem unlike any otherI'd wager that when you think of Microsoft, your first inkling is to affiliate the company with its Windows operating system. While this was the spark that ignited Microsoft's magical run throughout the 1990s, the company has made a lot of interesting moves since then.In the mid-2000s, Microsoft pursued a number of high-profile acquisitions that were meant to diversify the business. The company dolled out billions for services such as Skype and Yammer -- both of which used to complement Microsoft's existing productivity tools in the Office suite.However, in more recent years, Microsoft has transitioned from personal computing to more of a cloud operation. Although this has served Microsoft well, a new story is beginning to unfold as AI proliferates throughout Microsoft's ecosystem.Image source: Getty Images.A long-term story that's just beginningOne of the things that makes Microsoft so compelling is the company's constant pursuit of growth. In other words, Microsoft doesn't rest on its laurels. Rather, the company has consistently shown that it uses robust cash reserves to bolster existing product lines.In the midst of AI euphoria, Microsoft sent shock waves throughout the tech sector following a multibillion-dollar investment in OpenAI -- the start-up behind ChatGPT. Since partnering with OpenAI, Microsoft has integrated ChatGPT throughout many applications.For example, ChatGPT can now be leveraged in Microsoft Office tools such as Word, Excel, and Teams. Additionally, users can leverage ChatGPT on Microsoft's social media platform, LinkedIn. Furthermore, the company's Azure cloud infrastructure is arguably the most lucrative opportunity for Microsoft's AI ambitions.I'm not the only one bullish on Microsoft's prospects. The chart illustrates consensus estimates among Wall Street analysts for Microsoft's revenue and earnings over the next few years.Story continuesWith sales and profits expected to continue growing, I think long-term investors should be encouraged by Microsoft's moves in the AI space and optimistic about the impacts this technology can have on the company in the long run.MSFT Revenue Estimates for Current Fiscal Year ChartMicrosoft's future looks brightThe chart illustrates Microsoft's total return since going public. The main idea here is that investors who have held the stock over the last few decades have been handsomely rewarded.MSFT Total Return Level ChartThat said, I understand that holding on to a stock for that many years is easier said than done. Moreover, at a price-to-earnings (P/E) ratio of 36.2, Microsoft stock has gotten a bit pricey.Nevertheless, the reason I see Microsoft as such a generational opportunity is because I think it is a stock that you can own forever. The company provides investors with a high degree of exposure to many different end markets. The diversification of Microsoft's business is truly unparalleled.But with that said, investors must exercise patience because it will take years before the company begins to scale and generate meaningful growth in any particular segment.As the AI narrative continues to play out, I think Microsoft is one of the best-positioned enterprises to benefit from long-term secular tailwinds.Where to invest $1,000 right nowWhen our analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for two decades, Motley Fool Stock Advisor, has more than tripled the market.*They just revealed what they believe are the 10 best stocks for investors to buy right now… and Microsoft made the list -- but there are 9 other stocks you may be overlooking.See the 10 stocks*Stock Advisor returns as of April 22, 2024Adam Spatacco has positions in Microsoft. The Motley Fool has positions in and recommends Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.A Once-in-a-Generation Investment Opportunity: 1 Artificial Intelligence (AI) Stock to Buy Now and Hold Forever was originally published by The Motley FoolView comments"
    },
    {
        "title": "Magnificent Seven Stocks: Nvidia Stock Surges Above Key Level; Tesla Slides",
        "url": "https://finance.yahoo.com/m/4205eaa9-f620-3a0b-a81a-0e82c7c9fd0b/magnificent-seven-stocks%3A.html",
        "content": "Magnificent Seven stocks, including AI leader Nvidia, are among the best stocks to watch in today's stock market. Continue reading View comments"
    },
    {
        "title": "3 Stocks to Invest $30,000 in Right Now",
        "url": "https://finance.yahoo.com/m/3be9e033-2c01-373c-a3f3-18732f453ceb/3-stocks-to-invest-%2430%2C000-in.html",
        "content": "Tech stocks have a long reputation for providing consistent and significant gains over the long term, proven by the Nasdaq-100 Technology Sector's 395% rise over the last 10 years.The industry's ever-expanding nature is driven by reliable demand for upgrades to various hardware and software products. So, it's unsurprising that investing mogul Warren Buffett's holdings company, Berkshire Hathaway, has dedicated more than 40% of its portfolio to tech stocks. Meanwhile, Berkshire's holdings posted a compound annual gain of nearly 20% between 1965 and 2023.As a result, it could be worth following suit and making a sizable long-term investment in the high-growth sector. So, here are three stocks to invest $30,000 in right now -- $10,000 for each.1. Advanced Micro DevicesAdvanced Micro Devices (NASDAQ: AMD) business has exploded over the last decade, taking on a leading role in the chip market.A decade ago, the company was on the brink of bankruptcy, bleeding money alongside mounting debt. Then, in 2014, Lisa Su became AMD's CEO, triggering one of the most impressive turnarounds in the tech market's history.The launch of its Ryzen line of central processing units (CPUs) in 2017 has been a major growth catalyst, with AMD's CPU market share rising from 18% in the first quarter of 2017 to 33% in 2024. The company has gradually chipped away Intel's share, which fell from 82% to 64% in the same period.AMD ChartShares in AMD have soared 3,500% over the last 10 years. As a result, an investment of $10,000 in AMD's stock in 2014 would be worth more than $357 billion today.Of course, past growth doesn't always indicate what's to come. However, the company has an exciting outlook that could deliver major gains over the next 10 years. AMD is investing heavily in artificial intelligence (AI), launching new AI graphics processing units (GPUs) this year and investing in AI personal computers.The AI market hit nearly $200 billion last year and is projected to reach nearly $2 trillion by 2030. Alongside positions in other areas of tech, such as cloud computing, video games, and consumer PCs, AMD will likely continue benefiting from the tailwinds of tech for years.Consequently, an investment of $10,000 in AMD's stock over the next decade could deliver significant gains.2. AmazonIt's impossible to deny Amazon's (NASDAQ: AMZN) potent role in tech. Thanks to its popular e-commerce site, the company has built up immense brand loyalty worldwide. Amazon's retail site is available in over 20 countries and ships to more than 100 nations.Story continuesThe success of Amazon's e-commerce business has seen annual revenue climb 546% since 2014, with operating income skyrocketing by more than 20,000%.Amazon's meteoric rise is primarily owed to its lucrative Prime membership. Its subscription-based model bundles multiple services, including free expedited shipping on its retail site, video streaming, music, gaming, and more. Including multiple services makes consumers less likely to unsubscribe, leading to a global subscriber count above 230 million.AMZN ChartShares in Amazon have risen 926% since 2014, meaning an investment of $10,000 back then would be worth over $102,000 today. And the company could potentially beat that growth over the next 10 years.In addition to consistent retail growth, Amazon is rapidly expanding in AI and cloud computing. On April 25, the company announced plans to invest $11 billion to build data centers in Indiana to grow Amazon Web Services (AWS).The company is on a promising growth path, and if you have the means, it could be worth an investment of $10,000 this month. However, a smaller investment is still worth considering.3. AppleApple (NASDAQ: AAPL) is easily one of the most successful companies in tech history. Its market cap of $2.6 billion makes it the world's second-most-valuable company (only after Microsoft). Meanwhile, Apple's vast and loyal user base has allowed it to achieve leading market shares in multiple product categories.However, the company has stumbled over the last year. Macroeconomic headwinds led to repeated quarters of revenue declines in 2023. Apple's Q1 2024 seemed to break the streak, with revenue rising 2% year over year.Meanwhile, the tech giant's free cash flow hit $107 billion, significantly more than Microsoft, Amazon, or Alphabet. The considerable difference could suggest Apple is best equipped to keep investing in its business and come back strong in the coming years.AAPL ChartApple's stock has increased by 738% over the last decade. Consequently, a $10,000 investment in its shares 10 years ago would be worth nearly $84,000 today.Moreover, like AMD and Amazon, Apple is taking on AI head-on. Over the last year, the company has gradually added AI-driven features across its product range, with plans to overhaul its MacBook lineup to focus on AI. The company also recently acquired French AI company Datakalab, which specializes in on-device processing.Apple's dominating role in tech and exciting outlook could make it worth investing $10,000 in its stock, with plans to hold for at least a decade.Should you invest $1,000 in Advanced Micro Devices right now?Before you buy stock in Advanced Micro Devices, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $537,557!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of April 22, 2024Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Dani Cook has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, and Microsoft. The Motley Fool recommends Intel and recommends the following options: long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy.3 Stocks to Invest $30,000 in Right Now was originally published by The Motley FoolView comments"
    },
    {
        "title": "Investors to Big Tech: Mind Your Pocketbook",
        "url": "https://finance.yahoo.com/m/dce6508c-4ddb-3bb5-bc93-f1e285acc65b/investors-to-big-tech%3A-mind.html",
        "content": "STOCKS Big tech companies are sitting on huge piles of cash. Investors are judging them by how they plan to use it. Three of the companies in the Magnificent Seven reported profits and sales in recent days that topped Wall Street’s forecasts, while a fourth missed big. Continue reading View comments"
    },
    {
        "title": "Goldman Sachs’ Top 15 Stock Picks for 2024",
        "url": "https://finance.yahoo.com/news/goldman-sachs-top-15-stock-125416704.html",
        "content": "In this article, we'll take a look into Goldman Sachs' top 15 stock picks for 2024. If you prefer to skip the introduction about the investment bank and its recent business developments, you can just dive straight into Goldman Sachs' Top 5 Stock Picks for 2024.Established in 1869 by German immigrant Marcus Goldman, Goldman Sachs has evolved into the world's second-largest investment bank by revenue, amassing $1.65 billion in fees during the first quarter of 2024. From its modest origins in a one-room basement office adjacent to a coal chute, the bank has expanded steadily over the years. In 1906, it made its mark in the initial public offering (IPO) market with the iconic Sears, Roebuck, & Co. Goldman Sachs was among the pioneers in emphasizing price-to-earnings (P/E) ratios over book values for company valuation.Banks are intricately linked to the fluctuations in interest rates due to their core function of dealing with money. While consumers may lament higher rates, banks often welcome them as they can widen their profit margins, known as the 'spread,' even amidst reduced borrowing demand during tighter monetary conditions. However, higher interest rates can challenge banks to manage their asset base, including funds invested in securities like bonds. Sharp rate fluctuations necessitate the revaluation of these securities, potentially resulting in losses that could jeopardize the stability of even the most profitable of banks. This was evident in the US banking crisis of 2023, particularly impacting Goldman Sachs, which reported a substantial $470 million loss in its loan portfolio during the first quarter of that year. This loss was part of the bank's efforts to restructure its retail banking division in response to the challenging environment.Despite grappling with such challenges a year ago as it ventured into Main Street endeavors, Goldman Sachs came back strong by refocusing on its core strengths. In the first quarter of this year, it surpassed analyst expectations by nearly $1 billion, garnering close to $4 billion in earnings, largely driven by substantial profits in its trading and corporate advisory divisions. While analysts anticipated a turnaround in deal-making activities, Goldman Sachs exceeded this forecast. Notably, the bank's investment banking fees soared by an impressive 32% in the latest results, reaching $2.08 billion. Additionally, the consumer banking division reported a noteworthy 24% revenue growth, marking a refreshing change after years of costly losses and write-downs.Story continuesDespite the investment bank's surge in revenues, its net provisions for litigation and regulatory matters were a mere $23 million for the first quarter of 2024, a notable reduction compared to the previous year. Additionally, Goldman Sachs trimmed its workforce by 2% following the sale of home lending firm GreenSky in October. This divestiture aligns with the bank's recent strategic shift away from consumer banking to prioritize its core offerings: Global Banking & Markets and Asset & Wealth Management. Despite incurring a $506 million loss from the sale in 2023, CEO David Solomon remains optimistic, citing the resurgence of capital markets and promising business prospects in Goldman's core sectors as the catalysts for the bank's turnaround. These results were especially gratifying for the bank, coming shortly after rival JPMorgan Chase & Co. (NYSE:JPM) experienced its sharpest stock decline in almost four years, acknowledging a more challenging outlook than previously expected.Curious about Goldman Sachs' outlook for the future? Here's a glimpse into what its management said during its first-quarter 2024 earnings call:In debt capital markets, tighter spreads have contributed to a constructive issuance environment and investment grades with volumes hitting a record for the first three months of the year. Additionally, refinancing was a major theme with robust high-yield and institutional loan refinancing volumes. Given a more accommodative issuance backdrop as well as the potential for increased acquisition financing, alongside higher M&A activity, we expect solid levels of debt underwriting activity to continue this year. With our long-standing leadership positions across the global capital markets, we have been at the forefront in helping our clients access the markets and our firm stands to benefit further as transaction volumes rise from the 10-year lows.It’s important to note that alongside the reopening, we are seeing in capital markets, our intermediation businesses continue to be active in supporting our clients’ needs. And we’re growing financing revenues across FICC and Equities, which together were a record this quarter and rose 18% sequentially. All-in, our top-tier intermediation franchise, and more durable financing results are helping raise the floor in global banking and markets. In Asset & Wealth Management, assets under supervision rose to a new record of $2.8 trillion this quarter, which represented our 25th consecutive quarter of long-term fee-based net inflows. We have a diversified platform across public and private markets and are delivering solid performance across asset classes, and we continue to invest resources in growing this business, particularly across Wealth Management, Alternatives, and Solutions.Amidst a backdrop of cautious optimism brewing at JPMorgan, we've scrutinized its leading stock selections. Noteworthy among them are Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA).Goldman Sachs' Top 15 Stock Picks for 2024Our MethodologyTo compile our roster of Goldman Sachs' top stock picks for 2024, we reviewed the bank's submissions to the SEC, pinpointing its 15 most substantial investment holdings. Our evaluation process also incorporates insights from Insider Monkey's repository of 933 hedge funds, as of the final quarter of 2023. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator.15. Costco Wholesale Corporation (NASDAQ:COST)Goldman Sachs' Q4 2023 Investment Value: $2.27 billionNumber of Hedge Fund Holders: 57Costco Wholesale Corporation (NASDAQ:COST) operates a global network of membership warehouses renowned for offering high-quality, brand-name products at significantly lower prices than traditional retail outlets. As of April 25, the company provides a quarterly dividend of $1.15 per share, equating to a dividend yield of 0.64%. Impressively, Costco Wholesale Corporation (NASDAQ:COST) has consistently increased its dividend for the past 19 years, underscoring its commitment to rewarding shareholders.Insider Monkey's data reveals that Costco Wholesale Corporation (NASDAQ:COST) was held in 57 hedge fund portfolios at the end of Q4 2023, down from 65 in the previous quarter. Nevertheless, these hedge funds' stakes in Costco have a combined value exceeding $4 billion.Much like Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA), Costco Wholesale Corporation (NASDAQ:COST) ranks as one of Goldman Sachs' top stock picks.14. Accenture plc (NYSE:ACN)Goldman Sachs' Q4 2023 Investment Value: $2.34 billionNumber of Hedge Fund Holders: 58Accenture plc (NYSE:ACN) is a leading American multinational professional services company, providing consulting, technology, and outsourcing services to its clients. On March 21, the company announced a quarterly dividend of $1.29 per share, consistent with its previous dividend payments. Notably, Accenture plc (NYSE:ACN) has maintained a consistent dividend record since 2005 and has increased its payouts at an average annual rate of 12.33% over the past five years.In the fourth quarter of 2023, Insider Monkey's database revealed that 58 hedge funds held stakes in Accenture plc (NYSE:ACN), up from 55 in the previous quarter. The combined value of these holdings amounted to approximately $2.4 billion. GuardCap Asset Management emerged as the company's top stakeholder in Q4.13. Broadcom Inc. (NASDAQ:AVGO)Goldman Sachs' Q4 2023 Investment Value: $2.5 billionNumber of Hedge Fund Holders: 91Based in California, Broadcom Inc. (NASDAQ:AVGO) is a prominent American company specializing in semiconductor and infrastructure software products. The company derives a significant portion of its revenue from semiconductor-based products.In March, TD Cowen upgraded Broadcom Inc. (NASDAQ:AVGO) shares from Market Perform to Outperform and raised the share price target to $1,500 from $1,400.Insider Monkey examined 933 hedge fund portfolios for their shareholdings in the December quarter of 2023 and identified 91 stakeholders in Broadcom Inc. (NASDAQ:AVGO). Ken Fisher’s Fisher Asset Management held the largest stake, valued at $2.3 billion.12. Eli Lilly and Company (NYSE:LLY)Goldman Sachs' Q4 2023 Investment Value: $2.72 billionNumber of Hedge Fund Holders: 102Established in 1876, Eli Lilly and Company (NYSE:LLY) is a prestigious American pharmaceutical firm headquartered in Indianapolis, Indiana. Named after its founder, Colonel Eli Lilly, a pharmaceutical chemist and veteran of the Civil War, the company boasts a global presence, with operations in 18 other countries. Eli Lilly and Company (NYSE:LLY) currently distributes a quarterly dividend of $1.30 per share and has consistently increased its dividends over the past decade. Moreover, the company has an impressive history of paying dividends uninterrupted for 138 years. As of April 25, the stock offers a dividend yield of 0.72%.By the end of December 2023, 102 out of the 933 hedge funds analyzed by Insider Monkey had acquired and retained shares of the company. Among these, Ken Fisher’s Fisher Asset Management held the largest stake in Eli Lilly and Company (NYSE:LLY), valued at $2.6 billion.11. Berkshire Hathaway Inc. (NYSE:BRK-B)Goldman Sachs' Q4 2023 Investment Value: $2.8 billionNumber of Hedge Fund Holders: 117Berkshire Hathaway Inc. (NYSE:BRK-B), headquartered in Omaha, Nebraska, is a diversified multinational conglomerate holding firm primarily operating in the insurance sector. The company leverages the capital generated from insurance operations to invest in a wide range of subsidiaries, equity holdings, and securities across various industries. This diversified portfolio enables Berkshire Hathaway Inc. (NYSE:BRK-A) to maintain resilience in the face of challenges such as high interest rates.In the fourth quarter of the previous year, 117 out of the 910 hedge funds analyzed by Insider Monkey had invested in Berkshire Hathaway Inc. (NYSE:BRK-B). Among these investors, the largest shareholder was Michael Larson’s Bill & Melinda Gates Foundation Trust, which held 19.9 million shares valued at $7.1 billion.10. UnitedHealth Group Incorporated (NYSE:UNH)Goldman Sachs' Q4 2023 Investment Value: $2.95 billionNumber of Hedge Fund Holders: 113Based in Minnetonka, Minnesota, UnitedHealth Group Incorporated (NYSE:UNH) is a prominent American multinational corporation specializing in managed healthcare and insurance services. The corporation operates for profit and is structured into four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx.On April 16, UnitedHealth Group Incorporated (NYSE:UNH) released its first-quarter earnings report. The company posted a non-GAAP EPS of $6.91, exceeding estimates by $0.29. Revenue grew by 8.6% year-over-year to $99.79 billion, surpassing market estimates by $490 million.In the fourth quarter of 2023, 113 hedge funds held stakes in UnitedHealth Group Incorporated (NYSE:UNH), with total positions valued at $11.198 billion. This marks an increase from the preceding quarter, which saw 104 funds with positions valued at $10.95 billion. As of December 31, 2023, GQG Partners held the largest stake in the company, valued at $1.8 billion.UnitedHealth Group Incorporated (NYSE:UNH) joins the ranks of Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA) as one of Goldman Sachs' top stock picks.9. JPMorgan Chase & Co. (NYSE:JPM)Goldman Sachs' Q4 2023 Investment Value: $3.08 billionNumber of Hedge Fund Holders: 103Headquartered in New York, JPMorgan Chase & Co. (NYSE:JPM) operates globally across various sectors, including Consumer & Community Banking, Corporate & Investment Bank, Commercial Banking, and Asset & Wealth Management.On March 13, RBC Capital analysts maintained an Outperform rating on JPMorgan Chase & Co. (NYSE:JPM) with a price target of $185.Insider Monkey's analysis of 933 hedge fund holdings for their fourth quarter of 2023 shareholdings revealed that 103 had invested in the bank. Notably, Ken Fisher’s Fisher Asset Management held the largest stake in JPMorgan Chase & Co. (NYSE:JPM), valued at $2 billion.Carillon Tower Advisers said the following about JPMorgan Chase & Co. (NYSE:JPM) in its fourth-quarter 2023 investor letter:“PNC Financial and JPMorgan Chase & Co. (NYSE:JPM) performed well due to more benign inflation data, which the market likely interpreted as a sign that a recession is now less likely to occur. Recall that historically speaking, banks are hyper-cyclical stocks and typically will trade lower if investors foresee a recession, because recessions tend to trigger loan losses.”8. Meta Platforms, Inc. (NASDAQ:META)Goldman Sachs' Q4 2023 Investment Value: $3.96 billionNumber of Hedge Fund Holders: 242Headquartered in the United States, Meta Platforms, Inc. (NASDAQ:META) is a renowned multinational technology company recognized for its social networking services and advertising solutions, which span platforms such as Facebook, Instagram, Threads, and WhatsApp.On April 9, TD Cowen analyst John Blackledge reaffirmed a Buy rating on Meta Platforms, Inc. (NASDAQ:META) and increased its price target by $90 to $590. Additionally, TD Cowen raised the company’s revenue estimates for the first quarter of 2024 and the years 2024-2029 by 1%-4% annually.Insider Monkey's examination of 933 hedge fund holdings for their fourth quarter of 2023 shareholdings revealed that 242 had invested in Meta Platforms, Inc. (NASDAQ:META). Notably, Rajiv Jain’s GQG Partners held the largest stake, valued at $3.9 billion.7. Tesla, Inc. (NASDAQ:TSLA)Goldman Sachs' Q4 2023 Investment Value: $4.09 billionNumber of Hedge Fund Holders: 82Headquartered in Austin, Texas, Tesla, Inc. (NASDAQ:TSLA) is a leading manufacturer of fully electric vehicles and energy solutions. Their diverse product lineup includes popular models like the Model 3 and Model S sedans, Model Y and Model X SUVs, along with upcoming innovations such as the Cybertruck, Tesla Roadster, and Tesla Semi for light commercial use.Insider Monkey's analysis of hedge fund holdings at the end of December 2023 revealed that 82 out of 933 profiled hedge funds had invested in Tesla, Inc. (NASDAQ:TSLA). Notably, Philippe Laffont's Coatue Management emerged as the company's largest hedge fund shareholder, with a substantial $1 billion investment.Tesla, Inc. (NASDAQ:TSLA) was mentioned by Tsai Capital Corporation in its fourth-quarter 2023 investor letter. Here is what the firm commented:“Tesla has significant and underappreciated competitive advantages across multiple verticals including electric vehicles, software and energy storage. Misunderstood by much of Wall Street – and consequently a favorite of short sellers – Tesla continues to grow rapidly and increase its lead over the competition while delighting consumers in the process. [. . .] While we expect competition for EVs to intensify and for Tesla to lose market share over time, we also believe the company will increase production and deliveries from approximately 1.8 million vehicles today to approximately 15 million vehicles in 2030 and further its lead in autonomous driving capability. In fact, we expect Tesla will eventually license its autonomous driving software, creating high-margin (70-80%), recurring licensing revenue. Tesla is also one of only two companies that dominate the energy storage market, which has the potential to grow to several hundred billion in revenue as power plants around the world increase their focus on renewable energy.”6. Visa Inc. (NYSE:V)Goldman Sachs' Q4 2023 Investment Value: $4.8 billionNumber of Hedge Fund Holders: 162Visa Inc. (NYSE:V) is a financial services firm renowned for its provision of debit cards, credit cards, and associated services. With a robust global payment network, Visa (NYSE:V) stands out in the e-commerce sector, facilitating secure and efficient online transactions.Recently, on April 3, Visa Inc. (NYSE:V) unveiled its latest offering, Subscription Manager, as part of its Digital Enablement product suite. This service empowers financial institutions to offer cardholders a streamlined method to monitor their subscriptions directly through their banking apps.Insider Monkey's analysis of fourth-quarter 2023 shareholdings revealed that 162 out of 933 tracked hedge funds had invested in Visa Inc. (NYSE:V). Notably, Chris Hohn's TCI Fund Management held the largest stake, valued at $4.3 billion.In addition to Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA), Visa Inc. (NYSE:V) is one of Goldman Sachs' top stock picks for 2024.Click to continue reading and see Goldman Sachs' Top 5 Stock Picks for 2024.Suggested Articles:10 Unstoppable Stocks That Will Make You Richer10 Most Undervalued Value Stocks To Buy Now25 Biggest Social Media Companies and Platforms for AdvertisersDisclosure. None. Goldman Sachs' Top 15 Stock Picks for 2024. was initially published on Insider Monkey.View comments"
    },
    {
        "title": "Here's What Analysts Are Forecasting For Microsoft Corporation (NASDAQ:MSFT) After Its Third-Quarter Results",
        "url": "https://finance.yahoo.com/news/heres-analysts-forecasting-microsoft-corporation-121036532.html",
        "content": "As you might know, Microsoft Corporation (NASDAQ:MSFT) recently reported its quarterly numbers. Microsoft reported US$62b in revenue, roughly in line with analyst forecasts, although statutory earnings per share (EPS) of US$2.94 beat expectations, being 4.0% higher than what the analysts expected. Earnings are an important time for investors, as they can track a company's performance, look at what the analysts are forecasting for next year, and see if there's been a change in sentiment towards the company. Readers will be glad to know we've aggregated the latest statutory forecasts to see whether the analysts have changed their mind on Microsoft after the latest results. Check out our latest analysis for Microsoft earnings-and-revenue-growthAfter the latest results, the 51 analysts covering Microsoft are now predicting revenues of US$280.2b in 2025. If met, this would reflect a notable 18% improvement in revenue compared to the last 12 months. Statutory earnings per share are predicted to swell 15% to US$13.37. Before this earnings report, the analysts had been forecasting revenues of US$279.2b and earnings per share (EPS) of US$13.35 in 2025. The consensus analysts don't seem to have seen anything in these results that would have changed their view on the business, given there's been no major change to their estimates.It will come as no surprise then, to learn that the consensus price target is largely unchanged at US$475. There's another way to think about price targets though, and that's to look at the range of price targets put forward by analysts, because a wide range of estimates could suggest a diverse view on possible outcomes for the business. The most optimistic Microsoft analyst has a price target of US$600 per share, while the most pessimistic values it at US$400. These price targets show that analysts do have some differing views on the business, but the estimates do not vary enough to suggest to us that some are betting on wild success or utter failure.Of course, another way to look at these forecasts is to place them into context against the industry itself. We can infer from the latest estimates that forecasts expect a continuation of Microsoft'shistorical trends, as the 14% annualised revenue growth to the end of 2025 is roughly in line with the 13% annual growth over the past five years. Juxtapose this against our data, which suggests that other companies (with analyst coverage) in the industry are forecast to see their revenues grow 13% per year. So although Microsoft is expected to maintain its revenue growth rate, it's only growing at about the rate of the wider industry.Story continuesThe Bottom LineThe most obvious conclusion is that there's been no major change in the business' prospects in recent times, with the analysts holding their earnings forecasts steady, in line with previous estimates. They also reconfirmed their revenue estimates, with the company predicted to grow at about the same rate as the wider industry. There was no real change to the consensus price target, suggesting that the intrinsic value of the business has not undergone any major changes with the latest estimates.Following on from that line of thought, we think that the long-term prospects of the business are much more relevant than next year's earnings. At Simply Wall St, we have a full range of analyst estimates for Microsoft going out to 2026, and you can see them free on our platform here..Even so, be aware that  Microsoft is showing  1 warning sign in our investment analysis , you should know about...Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.View comments"
    },
    {
        "title": "The \"Magnificent Seven\" Day of Reckoning Has Arrived: Three Moves to Make Now",
        "url": "https://finance.yahoo.com/m/45093717-23ed-337b-b462-49833545b8ff/the-%22magnificent-seven%22-day.html",
        "content": "April 19 featured one of the most drastic tech-led sell-offs we've seen in a while, with Nvidia (NASDAQ: NVDA) falling 10% in a single session. All of the \"Magnificent Seven\" stocks got hit hard on Friday and led the Nasdaq Composite to fall 5.5% in a week.The Magnificent Seven is a term coined by Bank of America analyst Michael Hartnett and includes Microsoft, Apple, Nvidia, Amazon, Alphabet, Meta Platforms, and Tesla.Here are three moves you can make to brace for a prolonged market sell-off.Image source: Getty Images.1. Double-check your exposureOne of the most common mistakes investors make is to overly align themselves with a certain theme, sector, or type of stock.The easiest way for this to happen is that similar stocks go up more than the rest of your portfolio and then make up a larger percentage. This is exactly what has happened in the S&P 500, which is now comprised of 29.7% tech stocks.If you have held outperforming growth stocks for some time, your portfolio might have a higher allocation to growth than a few years ago.Another important factor to check is your exposure to stocks in exchange-traded funds and index funds. Every $100 invested in the S&P 500 is really about $30 in tech and $70 in the rest of the market. Out of every $100 invested in the Nasdaq Composite, over $40 goes into the Magnificent Seven.Many companies are also correlated to Magnificent Seven stocks. For example, if Nvidia gets hit hard, other chip stocks will also go down (precisely what played out during the April 19 sell-off).Understanding how your portfolio will likely perform in different situations can help you better manage your holdings and adjust your allocation with your investment objectives.2. Revisit investment thesesWhen volatility spikes, it's easy to get more emotional about investing. One way to counter emotions, on both the upside and the downside, is to have a clearly defined investment thesis for each stock you own.It's easier to let a winner run or have the patience to hold a stock when it sells off if you have clear expectations for a company. For example, a good reason for owning Microsoft is because of its rock-solid balance sheet, massive free cash flow generation, steadily growing dividend and buyback program, diversified business model, growing margins and sales, and its ability to invest in artificial intelligence (AI), cloud infrastructure, and other growth outlets without jeopardizing the strength of the business.In this vein, owning Microsoft isn't just about what it does in the coming quarter or year, but how it is positioned to capitalize on megatrends and return value to shareholders. Of course, investors want to make sure the valuation doesn't get out of hand, but it would take a seismic blunder for Microsoft's investment thesis to derail.Story continuesThe most volatile Magnificent Seven stock is probably Nvidia, which collapsed 10% on April 19 and fell nearly 13.9% last week.^IXIC ChartThe harsh reality is that if a move like that scares you, it might be best not to own Nvidia at all -- which is perfectly OK.Growth stocks like Nvidia aren't for everyone, and it takes a specific kind of risk tolerance to own them outright. For many investors, it might be better to get exposure to a company like Nvidia through an inexpensive fund like the Vanguard Growth ETF, where Nvidia is a top holding but is part of a diversified set of growth-focused stocks.3. Regularly contribute to your portfolioInvestors who regularly commit new savings to their portfolios could see the sell-off as a buying opportunity, especially now that valuations have become more attractive.It's never a good feeling to have no inflows in your portfolio and be 100% invested in stocks so that you have to sell or reduce a position to buy something else.Contributing cash regularly to a portfolio, even a tiny amount, provides the dry powder needed to put capital to work during a sell-off without selling a stock at a big loss.The path forwardYour approach to the sell-off in Magnificent Seven stocks will depend on your specific situation and portfolio needs. For example, if you go through a portfolio check and find out you already have plenty of exposure to the theme, you might want to do nothing.If you find out you own a stock for the wrong reasons after revisiting an investment thesis, you might want to consider what changes need to be made to get your portfolio back on track. If you are looking for more exposure to growth, you could allocate a higher percentage of new portfolio contributions to your favorite Magnificent Seven companies. Or you could instead consider ETFs that are concentrated in growth stocks.Most importantly, if you are a young investor or have a long time horizon, you will likely be a net buyer of stocks in the future, not a seller. In this position, sell-offs can actually work to your advantage.Understanding that long-term financial goals are far more important than how green or red your portfolio looks on a given day can help calm emotions and help you make grounded investment decisions, especially when there's a lot of noise in the market.Should you invest $1,000 in Nvidia right now?Before you buy stock in Nvidia, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $506,291!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.See the 10 stocks »*Stock Advisor returns as of April 22, 2024Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Bank of America is an advertising partner of The Ascent, a Motley Fool company. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Bank of America, Meta Platforms, Microsoft, Nvidia, Tesla, and Vanguard Index Funds-Vanguard Growth ETF. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.The \"Magnificent Seven\" Day of Reckoning Has Arrived: Three Moves to Make Now was originally published by The Motley FoolView comments"
    },
    {
        "title": "Tesla and Microsoft presented 2 distinct versions of AI. Investors liked both.",
        "url": "https://finance.yahoo.com/news/tesla-and-microsoft-presented-2-distinct-versions-of-ai-investors-liked-both-120001115.html",
        "content": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:The chart of the dayWhat we're watchingWhat we're readingEconomic data releases and earningsInvestors were treated to two different versions of artificial intelligence this week. And both sound pretty good.Microsoft (MSFT) announced a partnership with Coca-Cola (KO) in which the soft drink king would pay $1.1 billion to “jointly experiment” with Microsoft’s new Azure AI-based version of its cloud-based suite of productivity software.And when Microsoft’s quarterly results showed AI driving more and more of its cloud business growth and bullish guidance from an enthusiastic leadership team, the stock rose 2% Friday.Alphabet (GOOG, GOOGL) had a similar story, but with a stronger investor reaction — up 10% Friday — as investors reconsidered the company’s second-place position to Microsoft. Now, it seems YouTube, search, and cloud businesses are strapped in and ready for their AI-ification.On the other side of the table was Tesla’s (TSLA) earnings presentation. The company doubled down on its endgame of fully autonomous vehicles, a robotaxi fleet, licensing self-driving tech to other automakers — they’re in conversations, Elon Musk said — and the potential of harnessing the AI computing power of parked Teslas to create something akin to Amazon’s AWS, a bold but old idea that has been floating around since the 1980s.These are two very different visions of an AI future. “Productivity software” certainly doesn’t have the same ring as “robotaxi,” which is on the fun end of Peter Thiel’s “we wanted flying cars, instead we got 140 characters” spectrum we discussed two weeks ago.But as our Chart of the Week shows, investors liked both of them.And they should. Tesla’s surge was partially about rebutting some reasonable investor fears — cutting costs to tackle lagging demand and reaffirming that cheaper EVs are on the way. But the bigger story was the self-driving AI vision from the grand visionary.This is rare, and it’s why some people love Elon. For the most part, the path of AI first runs through the tedious corporate world of programmatic advertising and productivity tools, the core businesses of today’s big AI software/cloud players — Google, Microsoft, and Meta.On the other hand, Tesla’s splashy self-driving future of consumer cars and robotaxis is far more aligned with the “change the world” Big Tech expectation (aspiration, really) than the “better Office 365” reality we so often see.Story continuesBut these more mundane improvements are everything. It’s important to remember the lessons that any regional American city will teach you: Tons of America’s rich simply took the practical route, embracing the less glamorous business of fast-food franchising, agricultural processing, waste management, car dealerships, commercial properties, not to mention all the other B2B things you’d never think twice about. For every Zuckerberg, there are thousands of Buddy Garritys.Zuckerberg, however, may have taken the mundane too far Wednesday in Meta’s earnings call by, as our Hamza Shaban put it, making AI aspirations “seem small.” The company talked about “scaling business messaging,” “better ad insertion,” and selling AI computing power.And as we wrote in March, breaking productivity barriers is huge for the economy. But you still have to sell them. After all, they're still \"productivity gains,\" not flying cars.Ethan Wolff-Mann is a Senior Editor at Yahoo Finance, running newsletters. Follow him on Twitter @ewolffmann.morning brief imageFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click hereRead the latest financial and business news from Yahoo FinanceView comments"
    }
]